[
  "@kchangnyt https://t.co/eLvYOnn6zT",
  "Starship SN15 static fire completed, preparing for flight later this week",
  "@jeff_foust True 🤣🤣",
  "@kchangnyt Can’t get it up (to orbit) lol",
  "@heydave7 Seems quite likely at least based on revenue in 2022 &amp; possibly total units in 2023",
  "@stoolpresidente No, you do not. I have not sold any of my Bitcoin. Tesla sold 10% of its holdings essentially to p… https://t.co/JMnjABou4g",
  "@jgrano305 @Orangetilt Yes",
  "@Orangetilt Yeah, roughly 200MW/km^2 using currently available solar panels. \n\nWhat’s really amazing is that you ca… https://t.co/Ulbz8UlY2Q",
  "@PPathole An advantage I did have is that my father is a talented electrical &amp; mechanical engineer, so I was taught… https://t.co/D0xuHB5O19",
  "@PPathole True. The opposite in fact – I provide financial support to my parents.",
  "RT @Space_Station: The @SpaceX Crew-1 astronauts will soon soar back to Earth and parachute to a splashdown off the coast of Florida. They…",
  "@BLKMDL3 @JohnnaCrider1 We just got approval to open a new Supercharger station in Malibu!",
  "@JohnnaCrider1 https://t.co/xl441YNnOs",
  "@BadAstronomer So awesome!",
  "Let’s find out just how live Saturday Night Live really is 😈",
  "Am hosting SNL on May 8",
  "@Tesmanian_com Yup",
  "RT @SpaceX: Docking confirmed – second time at the @space_station for this Dragon https://t.co/JLC9wOjRFT",
  "@KuroiKumanoashi Lies can be beautiful",
  "https://t.co/l6Bc0wkWol",
  "define … beauty",
  "What does the future hodl?",
  "RT @RealLifeStarman: “We need to have a big permanently occupied base on the moon, and then build a city on Mars and become a spacefaring c…",
  "@OwenSparks_ @PPathole Absolutely!",
  "@PPathole This is the essence of my philosophy",
  "@SciGuySpace This is important",
  "@lexfridman Yup",
  "RT @SpaceX: Dragon has separated from Falcon 9’s second stage and is on its way to the @space_station! Autonomous docking tomorrow at ~5:10…",
  "2 mins to launch https://t.co/q9nXKRrXpw",
  "Astronauts preparing to launch to @Space_Station https://t.co/WBkaDZexEc",
  "@JiriThunderDome Yeah",
  "@ICannot_Enough Haha true",
  "RT @xprize: Elon Musk and Peter Diamandis LIVE on $100M XPRIZE Carbon Removal https://t.co/M2ruxS0Zxt",
  "🌍🌎🌏 Happy Earth Day 🌍🌎🌏",
  "@hnshah Haha",
  "@jhall 🤣🤣",
  "RT @SpaceX: All systems and weather are looking good for Falcon 9’s launch of Dragon with four astronauts on board. Webcast will go live to…",
  "@AstroJordy I’m staying at a friend’s place in Florida that is 85% powered by Tesla Solar Roof + Powerwall. \n\nWhen… https://t.co/5qtJec95aY",
  "@28delayslater Does seem a little weird",
  "@OwenSparks_ @AstroJordy @neuralink 🤣",
  "@JohnnaCrider1 @WholeMarsBlog If Tesla owners are “conspiracy theorists”, then it would be fair to call them “adver… https://t.co/GadN1Gg1un",
  "Tesla Solar + Powerwall battery enables consumers to be their own utility",
  "@jack True",
  "@ValaAfshar Very important. Most people don’t know this. Wind is also super cheap, especially when paired with batteries.",
  "@annerajb Newest units can probably do as much as 10kW continuous &amp; double that in peak power at 30C ambient temp.… https://t.co/2iI89NVjiB",
  "Powerwall 2 peak &amp; steady power capability is better than advertised. \n\nNow that we have lots of operational data,… https://t.co/qbdztDgIAf",
  "Solar power will feed exclusively to Powerwall. Powerwall will interface only between utility meter &amp; house main br… https://t.co/0A7Ygu0dV9",
  "Starting next week, Tesla Solar Panels &amp; Solar Roof will only be sold as an integrated product *with* Tesla Powerwall battery",
  "@wintonARK Did you buy a Powerwall? Utility permission is required for flowing electricity back to grid, but usuall… https://t.co/c9c9v5gY0H",
  "@TeslaNY Sandy Munro knows what he’s talking about",
  "RT @Commercial_Crew: Launch Update 🚀 @NASA and @SpaceX now are targeting Friday, April 23 at 5:49 a.m. ET for the launch of the Crew-2 miss…",
  "@teslaownersSV cgi irl!",
  "@PPathole @Tesla @SpaceX I could get a job, just not at an Internet company (weren’t many back then)",
  "@Liv_Boeree @TheBabylonBee Haha true",
  "@JohnnaCrider1 !!",
  "@kimpaquette New FSD rendering approach coming that better represents NN probability vector space",
  "@kimpaquette NHTSA is great",
  "@RenataKonkoly @GerberKawasaki Hell of a coincidence haha",
  "@GerberKawasaki 🤣",
  "RT @SpaceX: Falcon 9 and Dragon are looking good for flight of Crew-2 astronauts; teams are keeping an eye on launch site and downrange wea…",
  "@WholeMarsBlog Exactly",
  "@NASA Awesome!",
  "@Amart15416132 @WSJ Your research as a private individual is better than professionals @WSJ! \n\nData logs recovered… https://t.co/AtLNPtLDLn",
  "@teslaownersSV @SpaceX @NASA @considercosmos Support for humanity’s future in space is super appreciated. Let’s mak… https://t.co/7RzwJJOY9C",
  "@flcnhvy 🤣🤣",
  "RT @SpaceX: SpaceX and @NASA completed a full rehearsal of launch day activities with the four Crew-2 astronauts https://t.co/u0hDCTx3Zp",
  "@WholeMarsBlog Passive Autopilot (sometimes called active safety) comes standard on all Teslas",
  "@WholeMarsBlog Essentially, passive Autopilot (car intervenes only when crash probability is high) cuts crashes in… https://t.co/PYq10ndNat",
  "Tesla with Autopilot engaged now approaching 10 times lower chance of accident than average vehicle https://t.co/6lGy52wVhC",
  "Dragon spacecraft &amp; Falcon 9 rocket https://t.co/A6fsNlsN9z",
  "@WhatsupFranks Great progress by Tesla team",
  "If we make life multiplanetary, there may come a day when some plants &amp; animals die out on Earth, but are still alive on Mars",
  "@neuralink @shivon Great review! Neuralink is open to working with neuroscientists to advance the field. \n\nShort-te… https://t.co/OH1mkMhnCO",
  "Everything to the moon!",
  "We are honored to be part of the @NASAArtemis team",
  "🚀🖤💫 NASA Rules!! 💫🖤🚀 https://t.co/hmeGx2peZ6",
  "👀",
  "RT @Tesla: Cybertruck at Giga Texas https://t.co/c1RuektPnN",
  "🎸🎸 Austin Rocks!! 🎸 🎸",
  "@Model3Owners Same with Berlin",
  "@Model3Owners Limited production of Model Y this year, high volume next year",
  "@Model3Owners I was just there, driving Cybertruck around the site where it will be built!",
  "Make life multiplanetary! #Mars",
  "@Erdayastronaut @thesheetztweetz Yeah, should be fully mobile later this year, so you can move it anywhere or use i… https://t.co/kCmxyQhaAN",
  "@thesheetztweetz This is accurate. Service uptime, bandwidth &amp; latency are improving rapidly. Probably out of beta this summer.",
  "@sadiaslayy @DogecoinBets 😮",
  "@lexfridman One of many reasons that we need to make life multiplanetary!",
  "@austinbarnard45 Aiming to launch next week",
  "@billhuang688 @RationalEtienne @F9Block5 Certainly one of the largest. A company whose name rhymes with Shmoogle is… https://t.co/CUQXAF9PYU",
  "Doge Barking at the Moon https://t.co/QFB81D7zOL",
  "@WSBChairman Doge Barking at the Moon – Miro https://t.co/1vTM2XOusy",
  "@RationalEtienne @F9Block5 While perhaps obvious in hindsight, it turns out that the only way to solve self-driving… https://t.co/iTREuurL8p",
  "Le Petit Prince",
  "☾\n\n           🔭𖨆♡",
  "@SpaceXMR Soon it will be real",
  "@janixos @ErcXspace @SpaceX Actually, yes. And Red Rocket truck stop.",
  "@andyweedman @karpathy @DirtyTesla Stop … In the Name of Love! https://t.co/kBsTi5jz16",
  "@AustinTeslaClub @TslaCC @teslaquadcities @teslaownersvn @SjvTesla @TeslaOwnersEBay @CodingMark @billhuang688 @gailalfa1 @Tesla 🥰",
  "@Teslarati I found some footage of the drive https://t.co/TXeLQO9Spr",
  "@AstroJordy @dogeofficialceo @F9Block5 Insanely cute!",
  "@WholeMarsBlog Button timing of May is aspirational. Depends on how well limited beta of V9.0 goes, but I would be… https://t.co/M1DxOactEI",
  "@cliffski @F9Block5 Hopefully addressed this summer",
  "@dogeofficialceo @F9Block5 🤣🤣",
  "@BLKMDL3 @F9Block5 Same timing",
  "@F9Block5 Major improvements are being made to the vision stack every week. Beta button hopefully next month.\n\nThis… https://t.co/wRBxe5XiNr",
  "@jrosinski97 Will investigate",
  "@melaniemadri Probably late July",
  "Tesla AI/Autopilot engineering is awesome! Making excellent progress solving real-world AI.",
  "@ErcXspace @SpaceX 69th Raptor engine coming soon",
  "@ashleevance Maybe it’s about how you use it",
  "@PPathole @SwiftOnSecurity Getting there",
  "@AstroJordy @PPathole @SpaceX @Tesla That version of Falcon 1 never flew, so must be ~2004. The CAD looks so simple… https://t.co/aGUhFg67yQ",
  "@eugenelee3 @PPathole @SpaceX @Tesla Yeah, not scalable. My grad student idea was to try to use advanced chip makin… https://t.co/BeEBx3S1Kh",
  "@PPathole @SpaceX @Tesla That was my night job. Day job was working on ruthenium-tantalum ultracapacitors at Pinnacle Research.",
  "@PPathole @SpaceX @Tesla True. Ancient times … Had to flip CPU registers explicitly, as computer was so slow.",
  "@Erdayastronaut @Tesla Absolutely",
  "@Erdayastronaut @Tesla Tesla is building up collision repair capability to help address the grief that you went thr… https://t.co/szqDg49Xuq",
  "@vincent13031925 For now. Costs are decreasing rapidly.",
  "Love this beautiful shot",
  "@agnostoxxx @CathieDWood @ARKInvest Trust the shrub",
  "The art In Cyberpunk is incredible",
  "@itsALLrisky 🤣🤣",
  "@seinfeldguru @WholeMarsBlog Nope haha",
  "@WholeMarsBlog If you don’t say anything &amp; engage Autopilot, it will soon guess based on time of day, taking you ho… https://t.co/XAt4DoJSrM",
  "@DeltavPhotos @PortCanaveral That rocket is a hardcore veteran of many missions",
  "Blimps rock https://t.co/e8cu5FkNOI",
  "@engineers_feed Due to lower gravity, you can travel from surface of Mars to surface of Earth fairly easily with a… https://t.co/uvSBPGh3Hp",
  "@DrPhiltill Good thread",
  "@alexellisuk Pretty much",
  "@tesla_adri @WholeMarsBlog These things are best thought of as probabilities. There are 5 forward-facing cameras. I… https://t.co/U4Wn21WAYv",
  "@WholeMarsBlog Sensors are a bitstream and cameras have several orders of magnitude more bits/sec than radar (or li… https://t.co/a2RNHBidyn",
  "@WholeMarsBlog When radar and vision disagree, which one do you believe? Vision has much more precision, so better… https://t.co/38NMydEF52",
  "@WholeMarsBlog This is a major problem!",
  "Just needs some legs",
  "The Starship launch tower that catches the giant rocket booster is basically Mechazilla",
  "But wait how is the core of the earth lit by the sun? Stop asking questions!!",
  "Kong vs Godzilla has record for most meth ever consumed in a writer’s room",
  "@itsALLrisky 💯",
  "… going to moon very soon",
  "@Matsu_Kusarine @jagarikin Actually happened to me in Cyberpunk haha",
  "@TimBirks1 @Erdayastronaut @SpaceX Pretty much",
  "@memescryptor !",
  "Where is Shrek 5!? https://t.co/PqAZ5Mg8Es",
  "@AustinTeslaClub @OwenSparks_ @WholeMarsBlog Good point. \n\nNext major software rev will do much better with automat… https://t.co/O02a16kMjw",
  "@Adamklotz_ @OwenSparks_ @WholeMarsBlog Yup",
  "@teslaownersSV @neuralink Turns out 🐒 love video games &amp; snacks just like us!",
  "It’s all about the cufflinks https://t.co/elccqC0Zuf",
  "@chicago_glenn I feel like this sometimes",
  "@OwenSparks_ @WholeMarsBlog It will",
  "@OwenSparks_ @WholeMarsBlog Remove",
  "@w00ki33 @SpaceX @SuperclusterHQ Simulation is improving rendering resolution  …",
  "@cleantechnica Congrats to NIO. That is a tough milestone.",
  "@WholeMarsBlog Almost ready with FSD Beta V9.0. Step change improvement is massive, especially for weird corner cas… https://t.co/LPkYwr79kH",
  "Thanks to all that helped SpaceX!",
  "Just read it. Book is accurate. https://t.co/3bI9Vw8iP1",
  "@TeslaGong Yeah",
  "@mikevanbus @TrungTPhan @neuralink Pretty much",
  "https://t.co/XeQursZpvq",
  "Soon our monkey will be on twitch &amp; discord haha",
  "@thenewsoncnbc @contessabrewer Good piece!",
  "@Kyler_Knoll @neuralink Comes with wireless charging baseball cap",
  "@TarekWaked @TechCrunch @etherington Pretty much 🤣🤣 Great episode!",
  "A monkey is literally playing a video game telepathically using a brain chip!!",
  "@lexfridman @neuralink Yes",
  "The device is implanted flush with skull &amp; charges wirelessly, so you look &amp; feel totally normal",
  "@IheartTesla Absolutely doable. Possibly as soon as Neuralink device version 2, highly likely by version 3.",
  "Later versions will be able to shunt signals from Neuralinks in brain to Neuralinks in body motor/sensory neuron cl… https://t.co/baIez3HNbk",
  "@mindofkacper @neuralink Yes",
  "First @Neuralink product will enable someone with paralysis to use a smartphone with their mind faster than someone using thumbs",
  "@IheartTesla @neuralink Hopefully, later this year",
  "@tobyliiiiiiiiii Sure",
  "Monkey plays Pong with his mind https://t.co/35NIFm4C7T",
  "@dogeofficialceo @WatchersTank @SpaceX Looking at pups soon!",
  "@jordanxmajel @WatchersTank @SpaceX Shock absorption is built into tower arms. Since tower is ground side, it can u… https://t.co/mGFQjmDwNu",
  "@jordanxmajel @WatchersTank @SpaceX Load points just below the grid fins",
  "@WatchersTank @SpaceX Just one skyscraper catching another nbd haha",
  "Thanks Tesla suppliers for providing us with critical parts!",
  "@MarkJam93765764 @IvanEscobosa A tidal wave of vaccine is being produced!",
  "@jgrano305 Probably J&amp;J, but BioNtech &amp; Moderna are good too. Some debate imo as to whether a second synthetic mRNA… https://t.co/EzcTlBZ9V1",
  "@IvanEscobosa Latter",
  "To be clear, I do support vaccines in general &amp; covid vaccines specifically. The science is unequivocal. \n\nIn very… https://t.co/YRJgEc28fV",
  "@DavidWillisSLS @_Jevis_ @PPathole Needs legs for moon &amp; Mars",
  "@SciGuySpace Global payload to orbit is the key metric",
  "@Julius_Burton @Erdayastronaut @DJSnM @NASASpaceflight @ChrisG_NSF @thejackbeyer @FelixSchlang Nice",
  "@_Jevis_ @PPathole Ideal scenario imo is catching Starship in horizontal “glide” with no landing burn, although tha… https://t.co/O3WcE6CGLa",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed, completing SpaceX’s 10th mission this year https://t.co/c15BveB3QE",
  "@PPathole Starship booster, largest flying object ever designed, will be caught out of sky by launch tower. Big ste… https://t.co/e0FxBELd5Z",
  "@WholeMarsBlog Well-written and fair, much like his articles on space",
  "@louisssdev @flcnhvy Coming soon. Crazy number of launches this year!",
  "@flcnhvy They will be recovered from the water &amp; reused",
  "“Tanks for the memery!” – Panzer of the Lake",
  "@CathieDWood @wintonARK @ARKInvest What do you think of the unusually high ratio of S&amp;P market cap to GDP?",
  "@ID_AA_Carmack Some kind of ELO level, updated once or twice a year based on what someone actually got done, might… https://t.co/i3VBM0T0TZ",
  "@Thomas38697956 New &amp; improved version!",
  "@Teslarati @ResidentSponge Special mention of Tesla China",
  "@shbzz Obv",
  "@Teslarati @ResidentSponge Great work by Tesla team!",
  "@EvaFoxU Nice",
  "The Earth is not flat, it’s a hollow globe &amp; Donkey King lives there!",
  "@EvaFoxU Those two really could have come in handy for the stuck ship!",
  "@EvaFoxU Last Kingdom vs Vikings",
  "@spacex360 Ascent phase, transition to horizontal &amp; control during free fall were good. \n\nA (relatively) small CH4… https://t.co/jk6FLHd5qH",
  "RT @SpaceX: Dragon is go for the first-ever port relocation flight of a commercial spacecraft https://t.co/qV7AktWsqQ",
  "Godzilla vs Kong is so amaze much wow!\nMost insane movie I’ve ever seen!\nLove letter to conspiracy theorists!\nAnd y… https://t.co/hxeVFr7ofb",
  "@TerminalCount The Starships feast in Valhalla!",
  "@TerminalCount One of the greatest things I’ve ever seen",
  "@floko12022021 @HamblinZeke @katlinegrey Ich habe ein Semester Deutsch an der Universität studiert usw",
  "@HamblinZeke @katlinegrey Haha Falcon? Nein!",
  "@tobyliiiiiiiiii @katlinegrey I recommend propulsive landing, as that is extensible to planets, moons &amp; asteroids.… https://t.co/p8ERcmbcyR",
  "@PPathole @katlinegrey For practical purposes, there is no limit. It will just get increasingly difficult to service.",
  "@katlinegrey This a good path, but I recommend aiming for full reusability",
  "Urgent need to build more housing in greater Austin area!",
  "Austin++",
  "No it doesn’t hurt at all 🩸 https://t.co/NnL6o1si0V",
  "@allrocketsboi True",
  "@GerberKawasaki I fried a lot of neurons on that problem!",
  "Me in my sick new car\n(left him the money) https://t.co/EGaY1FVfHm",
  "@TrungTPhan Had no money to invest in Zip2, but my founder equity yielded ~$15M after tax. Of that, I rolled ~$10M… https://t.co/C2hVafVQ2k",
  "@Gfilche Major new Supercharger station coming to Santa Monica soon! Hoping to have 50’s diner &amp; 100 best movie cli… https://t.co/LZKHKd41wu",
  "@teslaownersSV @Tesla 🤣🤣",
  "@thesheetztweetz After all, SpaceX’s first payload to orbit &amp; back was a wheel of cheese …",
  "@FrancisSuarez @boringcompany @alexDLPmiami Glad you enjoyed the experience!",
  "SpaceX is going to put a literal Dogecoin on the literal moon",
  "Nicheman — his superpower is appealing to small audiences",
  "@waitbutwhy !!",
  "@lexfridman True",
  "Over 10,000 people are needed for Giga Texas just through 2022!\n- 5 mins from airport\n-15 mins from downtown\n- Righ… https://t.co/8TQPNnFmpe",
  "@jdeshetler @NASASpaceflight @SpaceX @BocaChicaGal Can be a little foggy sometimes :)",
  "@Erdayastronaut @LabPadre Barely a scratch. :)\nBack on the stand soon!\nWill report conclusions as soon as we know them.",
  "Starbase will grow by several thousand people over the next year or two",
  "@OwenSparks_ I sure hope so!",
  "@OwenSparks_ Agreed! We’re not super far, as Magic Valley Utility can give us almost all wind-power, which will be… https://t.co/1EyFnfgfcn",
  "Probably most “in space” you could possibly feel by being in a glass dome https://t.co/SOAIzxVGgX",
  "Am donating $20M to Cameron County schools &amp; $10M to City of Brownsville for downtown revitalization. Details to follow next week.",
  "@Adamklotz_ @SpaceX BN1 is a manufacturing pathfinder, so will be scrapped. We learned a lot, but have already chan… https://t.co/WcMKtiDK8z",
  "Please consider moving to Starbase or greater Brownsville/South Padre area in Texas &amp; encourage friends to do so!… https://t.co/TT5UbgUoU8",
  "@CodingMark @Adamklotz_ @SpaceX More like V10.0",
  "@Adamklotz_ @SpaceX Next major technology rev is at SN20. Those ships will be orbit-capable with heat shield &amp; stag… https://t.co/BAAxQa61cf",
  "@Adamklotz_ @SpaceX SN15 rolls to launch pad in a few days. It has hundreds of design improvements across structure… https://t.co/zTZ8MpdFqf",
  "@SpaceX Looks like engine 2 had issues on ascent &amp; didn’t reach operating chamber pressure during landing burn, but… https://t.co/1rwfZAJfiz",
  "@SpaceX At least the crater is in the right place!",
  "@SpaceX A high production rate solves many ills",
  "@Tesmanian_com Demand is no problem, but near-term cell supply makes it hard to scale Semi. This limitation will be less onerous next year.",
  "@Erdayastronaut Tracking to a potential 8am liftoff",
  "@wapodavenport That would be great, or possibly via video with full access to telemetry",
  "FAA inspector unable to reach Starbase in time for launch today. Postponed to no earlier than tomorrow.",
  "Possible Starship flight tomorrow afternoon",
  "@PPathole @nbcsnl Trying",
  "@ChitaGranger @frost_367 Who is 👌",
  "@nbcsnl Nice",
  "Wholesome memes https://t.co/u5TkHJua8Q",
  "@summerlinARK We should be laughing our asses off if it’s so damn smart!",
  "@summerlinARK I wanna know when AI will be able to do standup comedy well!?",
  "@summerlinARK Sounds about right",
  "@summerlinARK It’s not really possible to match the human brain in 2021 for any amount of money imo, but it will be… https://t.co/r1pqHA5U0D",
  "@cleantechnica This is crazy. Should use Tesla Megapacks for load-leveling the grid. More effective, more reliable and costs less.",
  "@AstroJordy Haha actually true",
  "Check out our new crane https://t.co/PE4vL6uKcb",
  "@RationalEtienne @TwitterSupport @jack This appears to be widespread. I wonder who is doing it …",
  "@ICannot_Enough @waitbutwhy We are too cell-constrained right now, but probably ok next year",
  "@waitbutwhy Great video",
  "@Erdayastronaut @SpaceX @Blackmagic_News @andrutay @bstineman @SpacePadreIsle @considercosmos Standing down SN11 un… https://t.co/eJQfgwDO0a",
  "@AdamSinger Haha",
  "@SpaceXMR Heavy comes in more like a javelin. Similar to Falcon 9, but caught by the tower vs landing on legs.",
  "@WholeMarsBlog I think there is a &gt;0% chance Tesla could be the biggest company",
  "@cleantechnica Solar has come a long way. Now just needs lots of long-life batteries!",
  "RT @Tesla: 6,000+ Superchargers across Europe — at 600 locations and counting!\n\n📸 by @EPavlic, @MinimalDuck &amp; @_better_e https://t.co/Yf36H…",
  "@SpaceXMR 🤣🤣",
  "@TheOnion Shame on you, Onion. This is why people are switching to @TheBabylonBee!",
  "@howlpolitically @TheOnion 2/2\nMy father &amp; his extended family have been dependent on financial support from my bro… https://t.co/hLAXPCGBWC",
  "@howlpolitically @TheOnion 1/2\nThis article is false. \n- I arrived by myself in Canada in ‘89 with ~CA$2500\n- Paid… https://t.co/tT5AshSsRC",
  "@JubanMohamed There will be no handles",
  "If there’s ever a scandal about me, *please* call it Elongate",
  "@universal_sci This comment thread is 🔥",
  "Don’t defy DeFi",
  "@itsALLrisky @KimDotcom 👀",
  "Mars rover looking back https://t.co/oaFOCezRuU",
  "@KimDotcom Fair point",
  "@dogecoinww @MattWallace888 @CorinnaKopf You raise a good point haha",
  "@blockfolio 🤣🤣",
  "@EvaFoxU Wow, shame on ZDF Info!",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed https://t.co/Xcbrq66Mez",
  "@lexfridman 👍",
  "Pay by Bitcoin capability available outside US later this year",
  "Tesla is using only internal &amp; open source software &amp; operates Bitcoin nodes directly.\n\nBitcoin paid to Tesla will… https://t.co/VngkpaxiVH",
  "You can now buy a Tesla with Bitcoin",
  "@WholeMarsBlog @joeys_lady @DrSej Yup",
  "@bindureddy And books haha",
  "@bindureddy You can basically learn anything on YouTube/Reddit",
  "RT @Fogdo: Thank you @Tesla for this helpful and cool feature :-) https://t.co/FLuY3yFdSL",
  "@flcnhvy @arstechnica @SciGuySpace SpaceX will be landing Starships on Mars well before 2030. The really hard thres… https://t.co/36AQOpFrQW",
  "@RenataKonkoly He was great on many levels https://t.co/exrZ1G9Rqk",
  "Strongest argument against aliens https://t.co/eF2FFZpJQE",
  "@lexfridman @AndrewYang !",
  "@WholeMarsBlog I once did a road trip across most of US with 2 adults &amp; 5 kids in a Model S!",
  "@arstechnica @SciGuySpace They are aiming too low. \n\nOnly rockets that are fully &amp; rapidly reusable will be competi… https://t.co/xQD6HUODqI",
  "@WholeMarsBlog The new Plaid S is our best car ever. Will be first production car to achieve 0-60mph in under 2 sec… https://t.co/1YrizvVpfs",
  "@TheMarsSociety SpaceX is developing rockets needed to make life multiplanetary — full &amp; rapid reusability at large… https://t.co/RmGaXDAYZ5",
  "@bluemoondance74 @NASASpaceflight Going well. Lot of work for an extra 20 secs of Isp!",
  "@NASASpaceflight Hopefully will happen this decade",
  "@newscientist True",
  "@cleantechnica I am accumulating resources to help make life multiplanetary &amp; extend the light of consciousness to the stars",
  "@CathieDWood When vast amounts of manufacturing are needed, as in robotaxis, this slows down rate of introduction,… https://t.co/Y6VvEqx4vp",
  "@Swaggerheim @SciGuySpace Not trying to roast, just being as literal as possible",
  "@johnkrausphotos 🤣🤣",
  "@AtomicsAstro @PPathole Yeah, but I’m English",
  "@SciGuySpace Not quite how I would tell the story, but it’s probably worth a read",
  "@PPathole This is important",
  "@TrungTPhan Wow, hard to believe that was 17 years ago!",
  "@TeslaPhx @CodingMark @EvaFoxU @jrosinski97 @daelmor @piangfa @Kristennetten @jessica_kirsh @JC_finance @jeremyjudkins !",
  "@Erdayastronaut @Twitter @TwitterComms @verified @jack Sigh",
  "@OwenSparks_ I actually ate the sandwich haha!",
  "@TheBabylonBee 🤣🤣",
  "Music in zero gravity https://t.co/bepfMipjrE",
  "@WholeMarsBlog Given significant architectural changes, including fundamental improvements to pure vision, there is… https://t.co/C2oJ58t0g3",
  "@SpacexVision An orbital propellant depot optimized for cryogenic storage probably makes sense long-term",
  "@Teslarati Преступленіе и наказаніе",
  "@MarcusHouse The [ahem] reach-around",
  "@RationalEtienne @jordanbpeterson We could talk about Life, the Universe and Everything",
  "@VinterNix @Bell Coming soon!",
  "@MoMoButFaster 🤣🤣",
  "@remouherek @SciGuySpace As you can see, I have a long history with using tents!",
  "@jordanbpeterson What would you like to talk about?",
  "@teslaownersSV 💯",
  "https://t.co/Ngk8SJvDUW",
  "@melaniemadri @thejackbeyer @NASASpaceflight Floor is installed, elevator is operational, waiting on glass",
  "@thejackbeyer @NASASpaceflight The high bay is measured to fit!",
  "@tobyliiiiiiiiii We will need launch tower for that. Hook height for the lift is ~140 m &amp; both booster &amp; ship need… https://t.co/XrJHWxToZf",
  "@Erdayastronaut Yes, Booster 1 is a production pathfinder, figuring out how to build &amp; transport 70 meter tall stage. Booster 2 will fly.",
  "First Super Heavy Booster https://t.co/0K5QPsEbbt",
  "@lexfridman Sometimes it’s about Doge",
  "@lexfridman Haha",
  "The simulation really struggled to make this look real haha https://t.co/t8zvFTRUHU",
  "Aspirationally acerbic alliteration \n-&gt; Bullshit baffles brains",
  "@Rjdlandscapes @Erdayastronaut @SpaceX That’s our goal",
  "SN11 almost ready to fly https://t.co/fXmjJZOiKk",
  "@Erdayastronaut @SpaceX cgi irl",
  "Actually, doesn’t feel quite right selling this. Will pass.",
  "@beeple 420M Doge",
  "I’m selling this song about NFTs as an NFT https://t.co/B4EZLlesPx",
  "@Tesmanian_com Yes",
  "@SciGuySpace SpaceX did 2X rest of world payload to orbit last year, probably 3X to 4X this year",
  "I love music. It makes my heart sing.",
  "This is good\n https://t.co/8KATmh2BJx",
  "Play your favorite song in a Tesla &amp; turn the volume to 11\n\nYou will see. You will feel.",
  "@____AMiR__ @SpaceX We will support as best we can",
  "@SpaceX Fly my pretties, fly …",
  "A puckish rogue https://t.co/98q8bCT68q",
  "@leastImAlive @itsALLrisky @vladtenev This is an opportunity for RH to outdo CB!",
  "@WholeMarsBlog What has become absolutely clear is that the plethora of self-driving corner cases can only be solve… https://t.co/e1f0uS71t1",
  "Falcon flies for the 9th time tonight",
  "@WholeMarsBlog It sees in all directions simultaneously",
  "I’m getting a Shiba Inu #resistanceisfutile",
  "@justpaulinelol Ja",
  "Homo sapiens techno: \nLoves raves &amp; technology",
  "RT @SpaceX: Targeting Sunday, March 14 at 6:01 a.m. EDT for Falcon 9's next launch of 60 Starlink satellites. The first stage booster suppo…",
  "Why are you so dogematic, they ask",
  "Origin of Doge Day Afternoon:\nThe ancient Romans sacrificed a Dogecoin at the beginning of the Doge Days to appease… https://t.co/RXfgPvRSHe",
  "Doge day afternoon",
  "Woketopia. Battle for the Moral High Ground in this new game!",
  "🎶 This Magic Moment 🎶",
  "@itsALLrisky Yes!",
  "@TSLAgang @SpinelessModer1 Yes",
  "@ashleevance For sure wise for elderly or immunocompromised to take the vaccine. Some debate about the second jab t… https://t.co/UkNNgAIXLm",
  "FSD Beta has now been expanded to ~2000 owners &amp; we’ve also revoked beta where drivers did not pay sufficient atten… https://t.co/lRlagKt5Am",
  "@pflodin @DoctorKarl Absolutely",
  "Both do mining &amp; use blocks &amp; chains",
  "BTC (Bitcoin) is an anagram of\nTBC(The Boring Company)\nWhat a coincidence!",
  "@FFairing @thejackbeyer @NASASpaceflight Quarks &amp; leptons",
  "@thejackbeyer @NASASpaceflight Green flame in this context means engine is burning internal components made of copp… https://t.co/cgxkyYGYCu",
  "@tesla_adri @28delayslater @TrevorMahlmann @SpacePadreIsle Dieses Jahr",
  "@ErcXspace @SpaceX @NASASpaceflight @Erdayastronaut Transparent aluminum (ALON) might be cool",
  "@TrevorMahlmann @SpacePadreIsle Celebrating a year of great work by the SpaceX team!",
  "@DraperYounce Wow!",
  "@_Shameless_Plug @Falcon9Block5 @bluemoondance74 @arstechnica @SciGuySpace .@BoredElonMusk",
  "@WholeMarsBlog Like @CyberpunkGame, but *with* self-driving haha",
  "@PPathole @arstechnica @SciGuySpace If 2021 manifest is met, SpaceX will do ~75% of total Earth payload to orbit wi… https://t.co/oqvtAe3jcq",
  "RT @SpaceX: Liftoff! https://t.co/Dth6zbYtR4",
  "@TezlaMick @arstechnica @SciGuySpace Yes",
  "@arstechnica @SciGuySpace Falcon 9 is almost always at max capacity. When it has “spare” performance, it flies back… https://t.co/mMiEwfi6OO",
  "@WholeMarsBlog @Herbert_Diess Fuel cells should be called fool sells! Such a silly choice for cars. Not great even… https://t.co/f7J8qG9P1g",
  "@PPathole I was just up there. Elevator on the other side. Floor is in, glass coming soon.",
  "@Erdayastronaut @tobyliiiiiiiiii @NASASpaceflight Yeah, we talked about that internally. Could just have it land on… https://t.co/diOyrv21cp",
  "@tobyliiiiiiiiii @Erdayastronaut @NASASpaceflight Might just catch the ship with the launch tower, same as booster",
  "@ashleevance Battery energy density is the key to electric aircraft. Autonomy for aircraft could have been done a l… https://t.co/PzsCPmel6T",
  "@Erdayastronaut @NASASpaceflight There were baffles, but one may have acted like a straw to suck bubbles in from ab… https://t.co/XLmQmbX8RG",
  "@Astro_Soichi ♥️ 🇯🇵",
  "@NASASpaceflight Fair point. If autogenous pressurization had been used, CH4 bubbles would most likely have reverte… https://t.co/U8ZDaPxW3y",
  "@austinbarnard45 SN10 engine was low on thrust due (probably) to partial helium ingestion from fuel header tank. Im… https://t.co/tricuXwrUw",
  "@eurotechjunkie @Alpsoy66 @WholeMarsBlog We will ask the regulators",
  "@WholeMarsBlog Build 8.3 of FSD should be done QA testing by end of next week, so that’s roughly when download button should show up",
  "@WholeMarsBlog Assuming user approves warning &amp; agrees to drive carefully, it will download latest QA-tested FSD “B… https://t.co/wVrXTyjqNu",
  "@CyberpunkGame Delamain AI cabs should be able to drive themselves when you’re in them &amp; be electric by 2077",
  "@WholeMarsBlog … it until you make it",
  "@thesheetztweetz Not connecting Tesla cars to Starlink, as our terminal is much too big. This is for aircraft, ships, large trucks &amp; RVs.",
  "Starbase, Texas https://t.co/mt4IpqqmjF",
  "@Harbles It’s all hot air in the end haha",
  "@Teslarati @KlenderJoey Still many fine details to address, but the final product will be fantastic. There’s nothing else even close.",
  "@WholeMarsBlog @klwtts Haha true. Yet, still, so much dignity is ascribed to horses!",
  "Carnot efficiency of the Universe?",
  "@engineers_feed Ultimately, yes",
  "Great band, too bad they broke up https://t.co/VQm7HhHw2M",
  "@garyblack00 Update probably in Q2. Cybertruck will be built at Giga Texas, so focus right now is on getting that beast built.",
  "@westcoastbill The $1400 is mostly good imo (UBI lite), as the people get to choose how the money is spent, but the… https://t.co/uOecCJuO6q",
  "@arctechinc Should be very soon. Many subtle differences between US &amp; Canada roads, so harder than it seems.",
  "@LarryKellogg @arctechinc The Tesla FSD computer started shipping in volume in Q2 2019. 2020 cars should all have F… https://t.co/3w2weJToWO",
  "Availability varies by region due to regulatory approval delays and/or Tesla internal development &amp; testing. \n\nNote… https://t.co/pJcaroozd5",
  "Due to high levels of demand for FSD Beta, adding “Download Beta” button to Service section of car display in ~10 d… https://t.co/OMj1xwuwMt",
  "Doge spelled backwards is Egod",
  "@WholeMarsBlog Beta V8.3 has literally ~1000 improvements. Will take time to QA internally before release probably in two or three weeks.",
  "@SomePaleGamer 🤣🤣",
  "@PPathole @TimSweeneyEpic This was way past leg loads. They got squashed hard.",
  "If you want the Tesla Full Self-Driving Beta downloaded to your car, let us know. Doubling beta program size now wi… https://t.co/Uwq5wkR9Ty",
  "@chicago_glenn @TimSweeneyEpic @TrevorMahlmann Starhopper is an old timer who has seen a lot of things!",
  "@TimSweeneyEpic Thrust was low despite being commanded high for reasons unknown at present, hence hard touchdown. W… https://t.co/4BbPumfM3N",
  "@TimSweeneyEpic Was super fun tbh haha",
  "@Jason Or is this just fantasy?",
  "🙄",
  "SN10 is in Valhalla now\nhttps://t.co/dHy4tDVGnI",
  "Cybervikings of Mars",
  "@WholeMarsBlog Tesla AI, both hardware &amp; software, is deeply underestimated",
  "@RenataKonkoly @skorusARK 🤣🤣",
  "@skorusARK Tesla &amp; Ford are the only American carmakers not to have gone bankrupt out of 1000’s of car startups. Pr… https://t.co/iWd8PzhmMi",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed https://t.co/ta7iXyr7BK",
  "RT @SpaceX: T-30 minutes until launch of Starlink. Webcast will go live ~15 minutes before liftoff → https://t.co/bJFjLCzWdK",
  "@Jason cgi irl @spacex",
  "@PPathole @SpaceX SpaceX team is doing great work! One day, the true measure of success will be that Starship flights are commonplace.",
  "@Erdayastronaut @SpaceX RIP SN10, honorable discharge",
  "Starship SN10 landed in one piece! https://t.co/lO4AF47MaN",
  "Launch abort on slightly conservative high thrust limit. Increasing thrust limit &amp; recycling propellant for another flight attempt today.",
  "5 mins to Starship test flight attempt",
  "March 3rd",
  "Starship launch tomorrow. Window opens at 9am.",
  "@LuvMyModel3 @billhuang688 @F9Block5 @PPathole Yes, beta will be offered much more widely when version 9 is done, hopefully next month",
  "RT @yousuck2020: 【発表】2023年に予定している月旅行に8名様をご招待します。本日より応募受付開始します！みんなで楽しい旅行にしましょう🚀🌍🌕 #dearMoon\nhttps://t.co/xBtOyJMIUh",
  "@billhuang688 @F9Block5 @PPathole FSD beta build V8.1 normally drives me around with no interventions. Next version… https://t.co/y9MwQQ1JxR",
  "@LabPadre @SpaceX You’re welcome",
  "@PPathole @Erdayastronaut @LabPadre @Larry_in_Canada Good point",
  "@Erdayastronaut @LabPadre @Larry_in_Canada Ok, let’s figure this out tomorrow. I’m all for exciting video coverage,… https://t.co/fMCv1P6VKR",
  "@LabPadre @Larry_in_Canada First I’ve heard of this. We’ll fix the situation. I’m a fan of @labpadre video!",
  "@DJSnM Indeed it was",
  "@F9Block5 @PPathole Sounds about right, but we want to be very careful with this transition period",
  "@PPathole There was still a surprisingly high usage of horses in 1940, but the trend was obvious",
  "@Adamklotz_ @SpaceX Space",
  "From thence to Mars,\nAnd hence the Stars.",
  "@nextspaceflight @NASASpaceflight An area much larger than Boca Chica",
  "@WootiezTV Very much so &amp; its leader shall be The Doge \nhttps://t.co/VXmuW5c0y9",
  "Creating the city of Starbase, Texas",
  "@Pslavi Cool",
  "@teslaownersSV Yup",
  "Horses are even self-driving! https://t.co/qPJrCFGs8J",
  "Scammers &amp; crypto should get a room",
  "@draecomino 2022: Dogecoin is dumb",
  "@WholeMarsBlog Note, buying FSD will still be a better long-term deal than subscription",
  "@WholeMarsBlog Q2 for sure",
  "Green eggs &amp; SPAC",
  "@totalspace360 Looks familiar haha. Nonetheless, the right move. Congrats to Rocket Lab.",
  "@WholeMarsBlog Tesla China team rocks!",
  "Doge meme shield (legendary item) https://t.co/CeomU9q84c",
  "New drug coming out called Regretamine. Pop one &amp; all regrets are gone.",
  "Always wondered where exactly your gaming character keeps all the stuff https://t.co/nNk2MeFGjf",
  "RT @Tesla: Use Tesla phone app to melt snow &amp; ice off your car before even leaving the house\n\n📸 by @cookie_esq https://t.co/P3r8JUOvpv",
  "RT @Tesla: Model 3 earns Top Safety+ award from IIHS for third year in a row https://t.co/rr0QtV20al",
  "@thesheetztweetz Ahem …",
  "https://t.co/jJeP4pFR6m",
  "Do androids dream of electric cars?",
  "@Sharvenium @flcnhvy 🤣🤣",
  "@flcnhvy https://t.co/VfQ72XyaiH",
  "@konstructivizm Nothing if not discreet",
  "@konstructivizm Hey babe 😉",
  "🙏 https://t.co/BBwnTndvoi",
  "@chicago_glenn @RationalEtienne @skorusARK We will use a catapult &amp; air mattresses to land on the roof, then base jump off",
  "@RationalEtienne @skorusARK Nickel is our biggest concern for scaling lithium-ion cell production. That’s why we ar… https://t.co/q2O9gYfnBj",
  "@harsimranbansal @skorusARK Absolutely",
  "@MemesOfMars @skorusARK Fremont shut down for two days (parts shortages) &amp; restarted yesterday",
  "@skorusARK This is not about winning anyone over. We are production-limited. The reason we are making our own cells… https://t.co/LrUBlk8zgp",
  "@RationalEtienne I hope they do! It would be awesome 🤣🤣",
  "@Rjdlandscapes @Tesla Prices in the US (of all goods) don’t include VAT, but it’s usually included in other countri… https://t.co/5GQYE5OPEK",
  "@cleantechnica 3mm of full hard 301 or 304 Stainless is bulletproof to a 9mm or .45",
  "Not a meta4, I mean actual books",
  "@GJGunit Both",
  "I admit to judging books by their cover",
  "Starship to the moon https://t.co/tVMJbBk3BU",
  "@johnkrausphotos Sounds like a good idea",
  "Out on launch pad, engine swap underway https://t.co/QNXGtL90WN",
  "@teslaownersSV Probably mid year, but Starlink is really meant for those who are least served. Bay usually has great Internet.",
  "You might see much higher download speeds on Starlink at times. Testing system upgrades.",
  "RT @Commercial_Crew: The @SpaceX Crew Dragon has officially been in space for more than 💯 days!\n\nThe Crew-1 mission launched on Nov. 15, 20…",
  "@jeff_foust Rockets are ridiculously hard (sigh)",
  "@VitoTheGreat_ I love dogs &amp; memes",
  "On the actual moon",
  "Literally https://t.co/XBAUqiVsPH",
  "@flcnhvy @HsueEugene @teslaownersSV @cleantechnica Potentially",
  "@TesLatino @teslaownersSV @cleantechnica Many steps forward, some steps back. Yes, we do a lot of QA before releasing a beta version.",
  "@_kenh @tobyliiiiiiiiii @Erdayastronaut @ErcXspace They will fly there from our launch site. \n\nStationed around the world.",
  "@HsueEugene @teslaownersSV @cleantechnica Seems likely",
  "@teslaownersSV @cleantechnica We’re upgrading all NNs to surround video, using subnets on focal areas (vs equal com… https://t.co/I2y0EGhL9V",
  "@cleantechnica Interesting",
  "@tobyliiiiiiiiii @Erdayastronaut @ErcXspace One of them may be in limited operation by end of year",
  "@TheFavoritist @NASASpaceflight @BocaChicaGal One of the engines is suspect, so we’re swapping it out",
  "@Erdayastronaut @ErcXspace Short-term, CH4 delivered &amp; O2 produced. Propellant is ~78% O2. Long-term, Sabatier reac… https://t.co/eCGRQlbcUf",
  "@AskDrStupid Just a Surface Detail",
  "@ErcXspace I hope we don’t go bankrupt building them!",
  "Excession",
  "@mimimusics 🔥🔥",
  "@PeterSchiff 🍆",
  "@PPathole Super cool",
  "@jgrano305 @AustinTeslaClub We have too much product complexity already",
  "@TechAmazing @UniverCurious Tunnels!!",
  "@JantieWillie @Adamklotz_ @AustinTeslaClub Hopefully, later this year",
  "@Adamklotz_ @AustinTeslaClub Later this year",
  "@jgrano305 @AustinTeslaClub It is still available off menu, but I don’t think the range, in many drive conditions,… https://t.co/WVt8k32gpt",
  "@AustinTeslaClub The Tesla Solar Roof is slightly hydrophobic, so water, snow or ice slide off easily",
  "@teslaownersSV Final design is looking👌\nWas just in the studio",
  "@eugenelee3 @SpaceXFan97 Most of Earth by end of year, all by next year, then it’s about densifying coverage. \n\nImp… https://t.co/lU9LXJK8Ow",
  "@SpaceXFan97 Speed will double to ~300Mb/s &amp; latency will drop to ~20ms later this year",
  "Of spaceflight",
  "RT @Tesla: Solar Roof even clears off the snow",
  "Hypernominalization",
  "Dojo 4 Doge",
  "@BocaChicaGal @NASASpaceflight Good chance of flying this week!",
  "@PPathole Should we?",
  "@RationalEtienne 🤣🤣",
  "@TheBabylonBee Why don’t we have these already!?",
  "Cryptocurrency explained https://t.co/kUXaXx8a1R",
  "Or did they say pegged to the dollar? Something like that …",
  "Heard a rumor some crypto coin was pegging the dollar 🤣🤣",
  "@MIT_CSAIL Machine learning is so amaze!",
  "@PPathole @dogecoin Just some used Antminer L3+ rigs bought off eBay. Not really economic, but it was a fun family project.",
  "@WholeMarsBlog Most people have no idea, even though there are so many FSD progress videos posted. Munro understood… https://t.co/ubVjEtg6Ok",
  "@dogecoin I just set up some little Doge mining rigs with my kids. It was fun.",
  "@redditSpacePorn 🤣🤣",
  "@PeterSchiff That said, BTC &amp; ETH do seem high lol",
  "@PeterSchiff An email saying you have gold is not the same as having gold. You might as well have crypto.\n\nMoney is… https://t.co/Ci7r8Q38Qc",
  "@chicago_glenn @archillect 🤣🤣",
  "@archillect Avocado Toast",
  "I just want to start a flame in your heart",
  "Just for a day",
  "@NASA Congratulations!!",
  "@YourLordThanos @Waymo 🔥🔥",
  "@realfuckingnews @business Somehow, a hash text file using ancient crypto can be exchanged for real goods &amp; services!? Amazing.",
  "@business To be clear, I am *not* an investor, I am an engineer. I don’t even own any publicly traded stock besides… https://t.co/OxZLHvxCVR",
  "@business Tesla’s action is not directly reflective of my opinion. Having some Bitcoin, which is simply a less dumb… https://t.co/fTCzXHyyPK",
  "@Teslarati SpaceX in south Texas &amp; Tesla in central have been providing direct assistance where feasible (eg save c… https://t.co/IHZY4O61U3",
  "@someone3201 @ERCOT_ISO Yes",
  ".@ERCOT_ISO is not earning that R",
  "@MattWallace888 @vladtenev @RobinhoodApp You’re right",
  "@Tesla Covered in snow &amp; ice, roads mostly closed &amp; no power in Austin",
  "@cz_binance @MansourShahrokh There will definitely be a MarsCoin!",
  "@itsALLrisky Sounds like it is",
  "RT @Tesla: Winter at Giga Texas https://t.co/eqL8lPICKe",
  "@BrennanChant @SpaceX Yeah. Active fairing half recovered though.",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed https://t.co/apZ7oTOvNk",
  "@rockstardenied @SpaceX SpaceX Boca team is helping save the turtles",
  "@MrotondiMy @ogeNews1 @ShaunStoffer ~5%",
  "@ogeNews1 @ShaunStoffer Disturbing concentration",
  "@MansourShahrokh Only if necessary",
  "@itsALLrisky Absolutely",
  "I will literally pay actual $ if they just void their accounts",
  "https://t.co/w11m1IAG0z",
  "@itsALLrisky Yup",
  "@JaneidyEve Temporarily lower, long-term raise",
  "@RationalEtienne An acceptable percentage. Doge is much more concentrated.",
  "If major Dogecoin holders sell most of their coins, it will get my full support. Too much concentration is the only real issue imo.",
  "@MarcusHouseGame Success on landing probability is ~60% this time",
  "было бы большой честью поговорить с вами",
  ".@KremlinRussia_E would you like join me for a conversation on Clubhouse?",
  "Lil meme juice for the weekend https://t.co/e9rVtk4SEe",
  "@Erdayastronaut Good analysis. We’re working on lowering min throttle of Raptor, so that there is engine redundancy… https://t.co/CFn03hoCBd",
  "@PPathole @dixonspace @Kristennetten @CathieDWood Yup. Banks are basically balkanized, heterogeneous databases with… https://t.co/Rdng3ZLVQ9",
  "@dixonspace @Kristennetten @CathieDWood A know a thing or two about payments",
  "RT @boringcompany: Congrats to the advancing teams in the Not-a-Boring Tunnel Competition!  Started with 390 competitors, down to the 12 fi…",
  "@kunalb11 I’m an alien",
  "@ID_AA_Carmack Ray tracing on Cyberpunk with HDR is next-level. Have you tried it?",
  "@joerogan @Spotify Great interview!",
  "@gtera27 Doge is underestimated",
  "@teslacn Congratulations Tesla China for amazing execution last year. Now on to the next for even more!!",
  "Happy New Year of the Ox! https://t.co/9WFKMYu2oj",
  "Frodo was the underdoge,\nAll thought he would fail,\nHimself most of all. https://t.co/zGxJFDzzrM",
  "@OwenSparks_ @flcnhvy @anonyx10 Haha thanks :)",
  "@flcnhvy @anonyx10 Indeed! Tweets definitely do not represent real-world time allocation.",
  "The most entertaining outcome is the most likely",
  "@GiveDirectly Just sent some",
  "Just agree to do Clubhouse with @kanyewest",
  "https://t.co/3rWE9uHSTS",
  "@geoffkeighley @UnrealEngine It’s getting real",
  "Bought some Dogecoin for lil X, so he can be a toddler hodler",
  "@JoshManMode He definitely has issues, but the sentencing seems a bit high",
  "@freewalletorg Thanks for fixing",
  "@freewalletorg Please unlock my account",
  "@AstroJordy 🤣🤣",
  "This is true power haha https://t.co/Fc9uhQSd7O",
  "@freewalletorg Any crypto wallet that won’t give you your private keys should be avoided at all costs",
  "@freewalletorg Your app sucks",
  "RT @SpaceX: NASA has selected Falcon Heavy to launch the first two elements of the lunar Gateway together on one mission! https://t.co/3pWt…",
  "@ajtourville Yes",
  "@BLKMDL3 @RationalEtienne @Adamklotz_ Once we can predict cash flow reasonably well, Starlink will IPO",
  "@RationalEtienne @Adamklotz_ Starlink is a staggeringly difficult technical &amp; economic endeavor. However, if we don… https://t.co/9Z8Ac6skqx",
  "@RationalEtienne @Adamklotz_ SpaceX needs to pass through a deep chasm of negative cash flow over the next year or… https://t.co/7J1c92hdjl",
  "@ID_AA_Carmack Lowest cost per ton of carbon sequestered, net of value of any product made. \n\nMust be scalable to g… https://t.co/XMyI7qWSgw",
  "@Adamklotz_ It’s meant to be the same price in all countries. Only difference should be taxes &amp; shipping.",
  "@tobyliiiiiiiiii This is intended for Earth, but there may be some ideas that apply to Mars too",
  "@CryptoShrikar @CoinDesk @Tesla @Dan_Z_Palmer 🤣🤣",
  "XPrize team will manage the $100M carbon capture prize https://t.co/fSw5IanL0r",
  "@SRuhle Everyone at Tesla receives stock. \n\nMy comp is all stock/options, which I do not take off the table. \n\nThat’s what you’re missing.",
  "Back to work I go …",
  "@CapybaraSurfer @MattWallace888 Does seem a bit high",
  "@itsALLrisky Doge appears to be inflationary, but is not meaningfully so (fixed # of coins per unit time), whereas… https://t.co/4UH4rARC6T",
  "@MichaelGalanin @kevinmgill Wow",
  "@Erdayastronaut @michaelhodapp_ 1. Orbital launch tower that can stack\n2. Enough Raptors for orbit booster\n3. Improve ship &amp; booster mass",
  "@michaelhodapp_ Back to work tonight!",
  "Ð is for Ðogecoin! Instructional video.\nhttps://t.co/UEEocOfcTb",
  "The people have spoken … https://t.co/x41oVMzTGo",
  "@Nivetha_7_42 @lexfridman So cute 💕",
  "@UniverCurious Extremely misleading image, as doesn’t reflect true time cost to people or rain &amp; pain",
  "🎶 Who let the Doge out 🎶",
  "Hodl the rainforests!!",
  "So … it’s finally come to this … https://t.co/Gf0Rg2QOaF",
  "@itsALLrisky It’s the most fun crypto!",
  "@JoshRoomsburg @SnoopDogg @genesimmons Its simplicity is its genius",
  "@astro_g_dogg @SpaceX Yup",
  "@Jbuttermost @Dogecoinrich 🤣🤣",
  "@wapodavenport True",
  "@Dogecoinrich 🤣🤣",
  "@flcnhvy @AstroJordy Not that easy. This is two decades of intense work. Have to look at old notes, emails, texts.",
  "@AstroJordy Yes",
  "Lessons learned",
  "Of Earth and Mars",
  "Time to tell the story of Tesla &amp; SpaceX",
  "@TheOnion Have you read @TheBabylonBee? It’s great!!",
  "The Second Last Kingdom https://t.co/Je4EI88HmV",
  "@DumDin7 @Grimezsz Haven’t heard that name in years …",
  "@Grimezsz Dogecake",
  "YOLT\n\nhttps://t.co/cnOf9yjpF1",
  "@Kristennetten That’s Damian",
  "@Kristennetten Yeah",
  "@OwenSparks_ Sure",
  "The great thing about restaurants is that you get to hang out with strangers! - SJM",
  "The future currency of Earth",
  "@redlineshifter Just a scratch",
  "Much wow!",
  "@RationalEtienne 🖤",
  "@wonderofscience Destiny",
  "@RenataKonkoly @Teslarati @woodhaus2 Franz was essential",
  "@Erdayastronaut @josh_bickett @ajtourville @SpaceX That said, the ship landing burn has a clear solution. My greate… https://t.co/e5Wikiugkz",
  "@Adamklotz_ @Erdayastronaut @josh_bickett @ajtourville @SpaceX Will still use hot gas maneuvering (RCS) thrusters,… https://t.co/vsO9h4Ioed",
  "@Erdayastronaut @josh_bickett @ajtourville @SpaceX Higher Isp too",
  "@Erdayastronaut @josh_bickett @ajtourville @SpaceX Intuitively, it would seem so, but turbopump-fed Raptors have mu… https://t.co/lBTG1sIBuC",
  "@brendan2908 @NASASpaceflight Yes",
  "RT @SpaceX: Falcon 9 will launch @NASA’s SPHEREx mission – which will collect data on more than 300 million galaxies and explore how the un…",
  "RT @SpaceX: Falcon 9 launches 60 Starlink satellites to orbit – mission from pad 39A on deck https://t.co/71cuCBgPNX",
  "@mikko @Darudevil It’s true!",
  "@josh_bickett @ajtourville @Erdayastronaut @SpaceX Yeah. By default, engine with least lever arm would shut down if all 3 are good.",
  "@ajtourville @Erdayastronaut @SpaceX Yes, but engines have a min throttle point where there is flameout risk, so la… https://t.co/ThniYsSnWn",
  "@Adamklotz_ @Erdayastronaut @SpaceX Yes",
  "@Erdayastronaut @SpaceX It was foolish of us not to start 3 engines &amp; immediately shut down 1, as 2 are needed to land",
  "I am become meme,\nDestroyer of shorts",
  "@commander_cruz Might actually happen",
  "Sandstorm is a masterpiece",
  "@MadOverlord We were too dumb",
  "Next time, we try pull *up* method https://t.co/J1M7WHLRDR",
  "Low-key Loki",
  "No highs, no lows, only Doge",
  "No need to be a gigachad to own",
  "Dogecoin is the people’s crypto",
  "ur welcome https://t.co/e2KF57KLxb",
  "@HuobiGlobal The most entertaining outcome is the most likely",
  "Doge",
  "https://t.co/vviUzWhodT",
  "@Erdayastronaut High seas &amp; wind",
  "This was a tough one https://t.co/beY7peFpCj",
  "RT @SpaceX: Watch Falcon 9 launch 60 Starlink satellites → https://t.co/bJFjLCzWdK  https://t.co/Ln95rEesbW",
  "Off Twitter for a while",
  "It will be filled with graffiti art",
  "@eiraum мы сделаем",
  "Giga Berlin progress https://t.co/ekpG5qcbUi",
  "@hamoon__ @neuralink Neuralink is working super hard to ensure implant safety &amp; is in close communication with the… https://t.co/Yky1llPUMd",
  "RT @SpaceX: This mission enables access for everyday people who dream of going to space",
  "RT @SpaceX: Announcing the first commercial astronaut mission to orbit Earth aboard Dragon → https://t.co/MbESvnakAD https://t.co/ukLsjFfRjk",
  "If you’ve worked on advanced wearables, phones or robots, those skills are needed @neuralink",
  "Feels weird helping make (hopefully good version of) Cyberpunk come true",
  "Please consider working at Neuralink!\n\nShort-term: solve brain/spine injuries\nLong-term: human/AI symbiosis \n\nLatte… https://t.co/qrC6aLAdS2",
  "https://t.co/XcCoKOjYlt",
  "On Clubhouse tonight at 10pm LA time",
  "@Erdayastronaut @TJ_Cooney @lrocket @SpaceX @FelixSchlang @MarcusHouseGame Tom has some great stories about experim… https://t.co/tEEzkIwcmK",
  "RT @Commercial_Crew: Launch Alert 🚀 @NASA and @SpaceX are targeting no earlier than April 20 for the launch of the second crew rotation mis…",
  "@Erdayastronaut @TJ_Cooney @lrocket @SpaceX @FelixSchlang @MarcusHouseGame He became a big fan of methane, but was… https://t.co/mdv0vDEFyC",
  "@TJ_Cooney @lrocket @SpaceX @FelixSchlang @MarcusHouseGame That sounds correct. Tom certainly deserves a lot of cre… https://t.co/hDRI4HfA8b",
  "@TJ_Cooney @lrocket @SpaceX @FelixSchlang @MarcusHouseGame Tom is great &amp; was instrumental in developing early vers… https://t.co/ULxTClM1g6",
  "@ErcXspace @smvllstvrs T/W will be ~1.5, so it will accelerate unusually fast. High T/W is important for reusable v… https://t.co/u1z2CPRRQJ",
  "@we5dogg @teslaownersSV No escaping that for me",
  "@TheBabylonBee Read the whole article 🤣🤣",
  "Warm, sunny day &amp; snowy mountains https://t.co/2k8psyqU4J",
  "What a beautiful day in LA https://t.co/EsCJTbzO9D",
  "@JayLav_ Yeah, Dr Frankensteen https://t.co/WDJ9K2UJqK",
  "@YounesH1989 I never used this guy. He gave a talk at SpaceX once.",
  "@flcnhvy Only Halo",
  "https://t.co/pyRCFE97Xp",
  "@Carnage4Life I sure hope that’s not true at Tesla or SpaceX!",
  "@thejackbeyer @NASASpaceflight Cryoproof, then install engines",
  "Starship SN9 &amp; SN10 https://t.co/urtPJn7amo",
  "In retrospect, it was inevitable",
  "@RGVaerialphotos Great shot",
  "@its_menieb Live by the sword, die by the sword",
  "@lexfridman Entropy",
  "@teslaownersSV @GameSpot Buy &amp; hold companies that make goods &amp; produce services you love",
  "@engineers_feed Earth is small &amp; we are smaller still https://t.co/gTOhcLGJ82",
  "@GameSpot 👀",
  "With Cyberpunk, even the hotfixes literally have hotfixes, but … great game",
  "https://t.co/a6kmk0PEgM",
  "@DocumentingBTC The dollar is shorting itself",
  "@westcoastbill Indeed",
  "@JohnnaCrider1 @Iupsychdoctor @AOC @RobinhoodApp Shopify is great too. SpaceX used them.",
  "@ohqwix @BnnJ6bCghvzQxLb 🤣🤣",
  "@wimgrommen @WSBChairman Indeed. The economy — making useful products &amp; providing great services — is what actually matters.",
  "@Iupsychdoctor @AOC @RobinhoodApp TANSTAAFL. Would be better to have small fees than no fees, as latter makes Robin… https://t.co/czRhLolYVO",
  "Here come the shorty apologists\nGive them no respect\nGet Shorty",
  "u can’t sell houses u don’t own\nu can’t sell cars u don’t own\nbut \nu *can* sell stock u don’t own!?\nthis is bs – sh… https://t.co/vJkf9BqbOD",
  "@RationalEtienne @teslavangelist Yes",
  "@28delayslater Finishing engineering this year, production starts next year. Aiming to have release candidate desig… https://t.co/bFverxpOQU",
  "@PPathole @Grimezsz I made that video!",
  "@AOC @RobinhoodApp Absolutely",
  "@NASASpaceflight Unlike its aircraft division, which is fine, the FAA space division has a fundamentally broken reg… https://t.co/sI63AXBJbz",
  "@EvanKaylor Nomad",
  "@anbuteau 🤗",
  "The esthetics of Cyberpunk are incredible btw. The interior design is👌.",
  "@TrevorMahlmann @SpaceX Major esthetics improvements coming",
  "@teslaownersSV @DMC_Ryan A little",
  "@DMC_Ryan New Roadster is part rocket",
  "@DMC_Ryan @lafebra @Gfilche There’s more storage now &amp; easily upgradable",
  "@avalonpenrose https://t.co/djdZxQ4Maz",
  "@Couch_Investor Yes",
  "@24_7TeslaNews @WholeMarsBlog Yeah, probably in a few months",
  "@WholeMarsBlog After you drive without using a PRND stalk/stick for a few days, it gets very annoying to go back &amp; use a shifter!",
  "@WholeMarsBlog No more stalks. Car guesses drive direction based on what obstacles it sees, context &amp; nav map. You… https://t.co/6gO7EHq9qy",
  "@avalonpenrose A hedge fund that shorts is a shrubbery",
  "@lafebra @Gfilche https://t.co/M0WwQSTAXm",
  "@lafebra @Gfilche Yeah, also a rear screen",
  "0 to 155mph trap speed in a 1/4 mile. 200mph top speed (with right tires).",
  "First production car ever to achieve 0 to 60 mph in less than 2 seconds",
  "It can play Cyberpunk",
  "Plaid Model S ships next month https://t.co/HFUPTnQiPB",
  "Even Discord has gone corpo …",
  "@Jason Yup. Wild times on Discord haha.",
  "https://t.co/F23fxQkBCE",
  "@AndyColt2 Waiting for FAA review …",
  "Gamestonk!! \nhttps://t.co/RZtkDzAewJ",
  "@LabPadre Passed initial pressure test",
  "@AdamHoov Yes",
  "@PPathole https://t.co/v7cffwac0A",
  "Bought a hand knit wool Marvin the Martian helm for my dog",
  "https://t.co/gpcvjIBTLM",
  "I kinda love Etsy",
  "@thesheetztweetz It does not serve the public to hamstring Starlink today for an Amazon satellite system that is at… https://t.co/sNiGKxdXFP",
  "@nextspaceflight We’re hoping for FAA approval of a test flight tomorrow afternoon",
  "@WholeMarsBlog The entire “stack” from data collection through labeling &amp; inference has to be in surround video. Th… https://t.co/u90Sqjkn8U",
  "@flcnhvy @WholeMarsBlog Yes, although it will be crazy not to turn  on FSD",
  "@WholeMarsBlog Tesla is steadily moving all NNs to 8 camera surround video. This will enable superhuman self-driving.",
  "@naval [Some tyranny]. Also, the road to hell is mostly paved with bad intentions.",
  "@levine Catchy! https://t.co/Au32MYF2Rn",
  "@Megaconstellati @Aviation_Intel @jetcitystar @larrypress All sats launched next year will have laser links. Only o… https://t.co/CeoFLi8Lzm",
  "@Megaconstellati @Aviation_Intel @jetcitystar @larrypress Yup",
  "@TeslaGong @teslaownersSV @cleantechnica I hope so",
  "@Tesmanian_com These also have laser links between the satellites, so no ground stations are needed over the poles",
  "@teslaownersSV @cleantechnica Sorry for the version confusion. V8.1 is what it should say for FSD. Separate version number for rest of car.",
  "@cleantechnica To my surprise, Tesla has better AI hardware &amp; software than Waymo (money)",
  "@RicGuccio @teslaownersSV It floats",
  "@flcnhvy @boringcompany Fallout-themed opening party for Vegas Loop happening as soon as allowed!",
  "@Alex_E_Benton @boringcompany 🤣🤣",
  "Under Vegas in @boringcompany tunnel yesterday with my boys https://t.co/tLfOuiEdFm",
  "@PPathole @SpaceX Lasers",
  "RT @SpaceX: SpaceX’s rideshare offering provides increased access to space for small satellite operators seeking a reliable, affordable rid…",
  "RT @SpaceX: Falcon 9’s first stage has landed on the Of Course I Still Love You droneship https://t.co/6gWWlLiXdG",
  "RT @SpaceX: Liftoff! https://t.co/js3zVM77rH",
  "@CodeWisdom 💯",
  "@teslascope We’re switching to a more sensible FSD version numbering to distinguish between major &amp; minor updates.… https://t.co/QmHipv5zQs",
  "@NASASpaceflight Hopefully, early next week",
  "RT @SpaceX: Due to unfavorable weather, we are standing down from today's launch; the team will continue with the countdown until T-30 seco…",
  "@arstechnica @SciGuySpace Given so many other companies are depending on this mission, it is getting even more scru… https://t.co/GBY9NACrSn",
  "Launching many small satellites for a wide range of customers tomorrow. Excited about offering low-cost access to o… https://t.co/w66u5qdUh9",
  "@GerberKawasaki They are part of the solution, but require lots of fresh water &amp; land. We may need something that’s… https://t.co/FWXsmo0f8t",
  "@Erdayastronaut @SpaceX SN9 https://t.co/kwTVwM7MBn",
  "@Erdayastronaut It’s a good path for fully renewable rocket energy, so solves part of problem, but longer chain hyd… https://t.co/xUGrZQiJzX",
  "Details next week",
  "Am donating $100M towards a prize for best carbon capture technology",
  "@Kristennetten @SpaceX @EliBurton_ @EvaFoxU @JaneidyEve @austinbarnard45 @ElonsBrain @JasoN7Patterson @AstroJordy @RenataKonkoly Pretty much",
  "@ElonsWorld @Tesla @SpaceX @neuralink @boringcompany @EashanMisra That would probably mean civilization is doing gr… https://t.co/sIAr8iFvWc",
  "@LaurenRow5 @EvaFoxU @RenataKonkoly @sarapolak_cz @seanmmitchell @28delayslater @ElonsWorld @JohnnaCrider1… https://t.co/vv6TthKR55",
  "@TesLatino @Tesla Absolutely! They rock. 🖤",
  "RT @SpaceX: Falcon 9 launches Starlink to orbit – the eighth launch and landing of this booster https://t.co/zyj8ZdDFql",
  "@kellyreid The rate-limiting part or process in cell production is constantly changing",
  "@FrancisSuarez @CityofMiami Cars &amp; trucks stuck in traffic generate megatons of toxic gases &amp; particulate, but… https://t.co/JcQIaCxJno",
  "@RationalEtienne @OwenSparks_ @Tesla With our giant casting machines, we are literally trying to make full-size car… https://t.co/CHGQMaIYTs",
  "@lexfridman @tegmark Tegmark is an exceptionally smart &amp; good human",
  "@OwenSparks_ The best manufacturing technology is in ultra high volume industries, like food &amp; beverage, some medical (eg syringes) &amp; toys",
  "Battery cell production is the fundamental rate-limiter slowing down a sustainable energy future. Very important pr… https://t.co/9ybABEzxCV",
  "@p_ferragu Looking into this. No question that FSD should be viewed as reasonably valuable when doing a trade-in.",
  "@tobyliiiiiiiiii @Erdayastronaut For sure",
  "@Erdayastronaut Glad you’re ok",
  "@Virgin_Orbit Congratulations!",
  "@teslaownersSV This is a good one",
  "@MrBeastYT I whistle",
  "@DMC_Ryan @C_R_H_M @Tesla Cybertruck doesn’t need a garage",
  "@DMC_Ryan @Tesla It will be awesome",
  "@owenshift Good point",
  "@signalapp Your server-side code is doing too much",
  "@Wikipedia Happy birthday Wikipedia! So glad you exist.",
  "@TheOnion Guess you been watching Cobra Kai",
  "@SuperclusterHQ @w00ki33 Fallout New Texas",
  "@Breedlove22 @benmezrich Only Chuck Norris can divide by zero",
  "@Cerberu21014829 @Breedlove22 @benmezrich Good point",
  "@Breedlove22 @benmezrich The thing we call money is just an information system for labor allocation. \n\nWhat actuall… https://t.co/JZ6zmQGBO3",
  "Monty Python is amazing\nhttps://t.co/UJq94IWT88",
  "@RationalEtienne @tobyliiiiiiiiii @Erdayastronaut They sure can twist the knife in that show!",
  "@tobyliiiiiiiiii @Erdayastronaut Probably wise",
  "@Erdayastronaut We’re making major improvements to ease of engine swap. Needs to be a few hours at most.",
  "@PPathole @johnkrausphotos @SpaceX Two of the engines need slight repairs, so will be switched out",
  "@johnkrausphotos @SpaceX Nice shot",
  "@realOmarAbdalah We don’t have high school internships, but please apply when you’re in college!",
  "@skorusARK Prototypes are easy, volume production is hard, positive cash flow is  excruciating",
  "@Tesla Physics",
  "RT @SpaceX: Splashdown of Dragon confirmed, completing SpaceX’s 21st @Space_Station resupply mission and the first return of a cargo resupp…",
  "@Erdayastronaut Detanking &amp; inspections now. Good progress towards our “Hop in &amp; go to Mars!” goal.",
  "All three static fires completed &amp; no RUDs!",
  "@justpaulinelol @Erdayastronaut @SpaceX Wow, a lot has happened in 10 years!",
  "@OfficialJlipper Fair enough haha",
  "https://t.co/ho7yGXAS3a",
  "@NASASpaceflight Sea shanty tiktok takes it to a new level with actual pirate ships",
  "@ConnectDotsToo Sure",
  "Today at SpaceX is about practicing Starship engine starts. Ship is held down by massive pins while engines are fir… https://t.co/QtIiWLxXPl",
  "@Tesmanian_com As promised",
  "Legalize comedy",
  "@lvladimirovBG You can steal our name/logos &amp; we probably won’t sue you",
  "@arstechnica @SciGuySpace We’re just trying to get people to Mars. Help would be appreciated.",
  "@SpaceX @Space_Station One day, we will get a camera up there that also shows the star field in the background",
  "RT @SpaceX: Separation confirmed! Dragon performing 3 departure burns to move away from the @Space_Station https://t.co/G27ohWvnXj",
  "@lexfridman Suicide is more than double homicide https://t.co/MvWGPs9uQE",
  "@lexfridman Absolutely",
  "Hey you …\nYeah you Queen …\nYou’re gonna make it! 💕💕 https://t.co/LrqdIrbIyd",
  "@TheOldManPar @DJSnM @MachinePix Hate to say it, but might be true",
  "@MachinePix The robot future is coming",
  "@wonderofscience @physicsJ 300km every millisecond, but there are times I wish it were faster",
  "https://t.co/TKkruvgBth https://t.co/ocy2gFRYvN",
  "@iamdevloper https://t.co/BkKeiIicYe",
  "Mus protec 👶 yoda https://t.co/1dvhG0nTkU",
  "@roscosmos Он был великолепен",
  "@RationalEtienne @TheBabylonBee This is an important distinction",
  "@ValaAfshar Much more than this &amp; increasing rapidly",
  "@CodingMark @flcnhvy It is",
  "@archillect Once in a while, something happens that is even better than we imagined",
  "@skorusARK The factory is the product",
  "@AustinTeslaClub @TheBabylonBee Probably commenting on @signalapp will do more",
  "@PPathole I bought the replacement glass from a junkyard for $20. They’re great places to get spare parts.",
  "@TheBabylonBee A lot of people are going to be super unhappy with West Coast high tech as the de facto arbiter of free speech",
  "@alexandersibert @signalapp Already donated to Signal a year ago. Will donate more.",
  "@benmezrich I am primarily trying to advance two causes: sustainable energy &amp; extending life/consciousness beyond E… https://t.co/VYBfaVHkys",
  "@song_wooseok @GerberKawasaki @benmezrich 🤣🤣",
  "@Ragazaga5 @SpacePadreIsle Maybe a Tesla AI day later this year",
  "@SpacePadreIsle The Prancing Pony?",
  "@BoredElonMusk 🤣🤣",
  "@erigganewmoney 😢",
  "@mayemusk It’s true",
  "@glenn22x @woketopiansa Yes, but not for long",
  "@woketopiansa Yeah, they seemed optimistic too",
  "My 14-year-old son, Saxon, said he feels like 2021 will be a good year. I agree. Let us all make it so.",
  "@Erdayastronaut @SpaceX Was also thinking that SpaceX Boca should hold fun parties and give tours for the community from time to time",
  "@Erdayastronaut @SpaceX I super support public spaces around our production &amp; launch sites, wherever it can be done… https://t.co/wmqWcT2WFH",
  "@Christo49699922 @sean18743005 @Erdayastronaut @SpaceX That too",
  "@sean18743005 @Erdayastronaut @SpaceX Catapult high into the air &amp; land on the roof with a base jumping parachute (the only way to travel)",
  "@Erdayastronaut @SpaceX That’s actually our restaurant, but SpaceX is building a futuristic bar at the top of the h… https://t.co/z2UmtGSAoI",
  "@techreview And increase fun! Hopefully.",
  "@benmezrich Me neither",
  "@TonyChoMrMagic @TeslaEnergy One of the best Tesla Solar Roof installations",
  "@91demigod No, but maybe one day",
  "@PPathole @engineers_feed Yes, that would be the best way to do it. A large solar field or reactor is needed for po… https://t.co/Ph6x1PlnaM",
  "@engineers_feed His sick beats https://t.co/8PbsgffzRp",
  "@flcnhvy Probably less than a few dozen primary decision-makers. Technically, only three.",
  "@Erdayastronaut @lexfridman Or at least the option for verification, so that the public can ascribe more credibilit… https://t.co/jU4WemVsjG",
  "Launch underway https://t.co/wbk7ZZ0Fqx",
  "Btw, critical feedback is always super appreciated, as well as ways to donate money that really make a difference (way harder than it seems)",
  "@eugenelee3 @engineers_feed Yup",
  "@engineers_feed Indirectly, an electric rocket is possible by using electricity to convert CO2+H2O —&gt; CH4+O2. This… https://t.co/fqzOtWQT9d",
  "@engineers_feed Not to get to orbit, unfortunately. In space, photon emission powered by matter-antimatter annihila… https://t.co/Y8PO10oPQN",
  "@Teslarati @ResidentSponge This will be hard to make, as it isn’t like any other vehicle",
  "@4thFromOurStar Playing the long game",
  "@ashleevance True",
  "@ID_AA_Carmack I hope so. Wings don’t work on the moon at all and def not well on Mars. Also, no runways.",
  "@EricRWeinstein Hamiltonians have +2V the potential of Langrangians and a play!",
  "https://t.co/2ja38Z8MRE",
  "@teslaownersSV Well, back to work …",
  "@teslaownersSV How strange",
  "Use Signal",
  "@TheHackersNews Ya don’t say. Reminds me of this timeless classic … https://t.co/Gq1wayoTIr",
  "@UniverCurious Fast water with tiny rocks",
  "@flcnhvy Yes, and then Occam’s razor is actually third most likely",
  "As seen from an external observer, not the participants",
  "The most entertaining outcome is the most likely",
  "@PPathole Dumb and Dumber is a great movie tho",
  "This is called the domino effect https://t.co/qpbEW54RvM",
  "@Dtrford @austinbarnard45 @AlexSvanArt @ErcXspace @SpceEnthusiast @SpacexVision @TomDixonDesign @SpaceX… https://t.co/eS5gArRyvS",
  "Because of the large footprint, it may seem flat, but actually ranges up to 5 stories tall",
  "Snow falling on Giga Berlin https://t.co/eTXMtYp8hG",
  "@RGVaerialphotos @SpaceX Yes",
  "@Gfilche 😉",
  "@flcnhvy Tesla is responsible for 2/3 of all the personal &amp; professional pain in my life combined. But it was worth it.",
  "So proud of the Tesla team for achieving this major milestone! At the start of Tesla, I thought we had (optimistica… https://t.co/1wlybPKMZj",
  "RT @Tesla: In 2020, we produced and delivered half a million cars. Huge thanks to all those who made this possible.\nhttps://t.co/q43vz6RMhd",
  "@newscientist Um, we have giant fusion reactor in the sky that works with no maintenance",
  "@comma_ai Tesla Full Self-Driving will work at a safety level well above that of the average driver this year, of t… https://t.co/jmABJUqfDF",
  "@PPathole Dojo isn’t needed, but will make self-driving better. It isn’t enough to be safer than human drivers, Aut… https://t.co/dyy2rMhgIl",
  "Ignore the heading",
  "Great interview with Mathias Döpfner\nhttps://t.co/ewnaHc4cH0",
  "@jack 🎩 The Greatest Gatsby 🎩",
  "@flcnhvy Inspired by the ballet",
  "@smvllstvrs @ErcXspace Rocket motion is primarily vertical, so you want the top open",
  "@jack Let’s make the roaring 20’s again!",
  "@Erdayastronaut Might be a few lumps along the way",
  "@Erdayastronaut @flcnhvy @ErcXspace Production is hard, prototypes are easy. Building ~1000 Starships to create a s… https://t.co/XJLLjplJbP",
  "@ICannot_Enough @AloysiusFekete @RationalEtienne @biogirl09 @ErcXspace Exactly",
  "@RexChapman Haha",
  "@Erdayastronaut @flcnhvy @ErcXspace SN9 will press CH4 header tank with helium. Long-term solution is under debate.… https://t.co/kaWWoL54jG",
  "@flabellina212 @RationalEtienne @biogirl09 @ErcXspace Yes",
  "@RationalEtienne @biogirl09 @ErcXspace Legs would certainly work, but best part is no part, best step is no step",
  "@flcnhvy @ErcXspace Yes",
  "@flcnhvy @ErcXspace Saves mass &amp; cost of legs &amp; enables immediate repositioning of booster on to launch mount — rea… https://t.co/jwDCjArymJ",
  "@ErcXspace We’re going to try to catch the Super Heavy Booster with the launch tower arm, using the grid fins to take the load",
  "Snake-head dog had my undivided attention until winder-head ostrich came gliding through all nonchalant https://t.co/dtPMdM3TQp",
  "@Tesmanian_com Seems odd that the opposition group is from BMW’s home state of Baveria. That‘s very far from Brande… https://t.co/M7DYvli4cx",
  "@Tesmanian_com This is very sensible. Opposition from anywhere cannot mean no progress everywhere!",
  "@harsimranbansal Literally",
  "@tobyliiiiiiiiii Are we sure this is real?",
  "Destiny, destiny\nNo escaping \nthat for me",
  "All Tesla cars delivered in the final three days of the year will get three months of the Full Self-Driving option… https://t.co/PPaEreeo8y",
  "@SpaceNews_Inc And Mark Dankberg. This action is wack, not dank!!",
  "@Reza_Zadeh Less?",
  "@ashleevance Westworld",
  "The Last Kingdom show is great",
  "@jayson32292601 Absolutely. Will be text &amp; visualization, but could add voice too.",
  "@sfs_central !! Even cheese is made of cake !!",
  "@karpathy If they don’t love us, we’re in deep trouble!",
  "Not everything is made of cake https://t.co/oMaCmYQAwx",
  "@chicago_glenn True haha",
  "Such a weird game when you think about it https://t.co/5MrvVzmeKG",
  "This is not CGI https://t.co/VOivE97vPR",
  "@BenSullins We need a UI overhaul",
  "@Maldivawow @CodingMark @Tesla No, these are just incremental improvements to the production codebase. FSD build is… https://t.co/07pUOraMGo",
  "@SpaceNews_Inc Starlink “poses a hazard” to Viasat’s profits, more like it. Stop the sneaky moves, Charlie Ergen!",
  "Entertainment will be critical when cars drive themselves",
  "@kimpaquette Just meeting with Larry Ellison to seek some advice. Back working on Tesla end of quarter tomorrow.",
  "@richierichhhhh_ Absolutely",
  "What should Tesla do with in-car gaming in an autonomous world?",
  "@PPathole @WSJ Absolutely",
  "@Tesmanian_com Taste of the future",
  "Try playing Polytopia in your Tesla! Great game. Multiplayer online version coming soon.",
  "@WSJ Focus on making products &amp; services people truly love, so that the total economic pie is bigger, instead of en… https://t.co/qe4jcEzyTq",
  "@ThatDesignGuy @m_siphiw @moosuraj @Tesla Roughly 95% of parts in Tesla Roadster were unique — not in any other pro… https://t.co/R3yB6CmRB8",
  "@LaurenRow5 @karpathy Yes",
  "@engineers_feed Very important",
  "@teslaownersSV @lexfridman Ok, service might be able to do this. Will check.",
  "@teslaownersSV @lexfridman You mean install the external speaker on earlier cars that don’t have it?",
  "@GUNMTLM3 @lexfridman No, but definitely this year",
  "@lexfridman Good point",
  "@conexionspacial @spacecoast_stve @NASASpaceflight Interesting",
  "@flcnhvy Liz has always done great interviews",
  "@spacecoast_stve @NASASpaceflight Falcon was 25% of successful orbital launches in 2020, but maybe a majority of pa… https://t.co/PmGu4vHQEZ",
  "@karpathy Vaccines are just the start. It’s also capable in theory of curing almost anything. Turns medicine into a… https://t.co/URuVC4QF1A",
  "@jgrano305 @TeslaTruckClub @jeremyjudkins @JPUConn @jchybow @DirtyTesla Yes",
  "@TeslaTruckClub @jeremyjudkins @JPUConn @jchybow @DirtyTesla We will offer multiple display options",
  "@IvanEscobosa @Erdayastronaut @teslaownersSV A few more revisions needed. Probably Beta 10 or 11.",
  "@Erdayastronaut @teslaownersSV Sure",
  "@Erdayastronaut @teslaownersSV Haha ok",
  "@kkvr2823 @tesla_adri @teslaownersSV There are subtle, important, differences between US &amp; Canada traffic rules, bu… https://t.co/XZX9ppVL92",
  "@tesla_adri @teslaownersSV Yes",
  "@teslaownersSV We need a “match other traffic speed” setting",
  "@stevewoz Definitely",
  "@flcnhvy @h3_extrachars It’s a step in that direction",
  "@13arm13arm It’s one 🔥 or 1/2 🔥 if you don’t have a car with pedestrian speaker. We couldn’t get everything done in… https://t.co/7HkZA1OhE4",
  "@westcoastbill The writing on Cobra Kai is sick👌",
  "@AfloatHickory Haha I will save you the nightmare of seeing me in those shorts",
  "@h3_extrachars You can upload custom music/sounds",
  "@jgrano305 Unfortunately, pedestrian speaker is needed, otherwise no external sound generator except actual horn",
  "Change your horn sound to 🐐, 🐍🎷, 💨 or holiday jingles with latest Tesla software update!",
  "Merry Christmas &amp; happy holidays! 🎁 https://t.co/uk6NSPwR9R",
  "@Tesmanian_com Great game!",
  "@harsimranbansal @heydave7 It will most likely make sense for Starlink to go public once the revenue growth is reasonably predictable",
  "@heydave7 Engineering, design &amp; general company operations absorb vast majority of my mind &amp; are the fundamental li… https://t.co/VxV7gHUMbd",
  "@ElonsWorld @Real_Futurist @lexfridman Yes",
  "@flcnhvy @MarcusHouseGame A few months",
  "@MarcusHouseGame Coming soon",
  "@OLHZN Minor",
  "@TrevorMahlmann Yeah",
  "12 story rocket turns off its engines &amp; does a controlled fall https://t.co/HCRgyx42rn",
  "@Erdayastronaut Yup, we’re just ironing out a few bugs",
  "To Tesla owners taking delivery in the final days of year, your support is super appreciated!!",
  "@DeepMind @nature Frictionless AI. What could possibly go wrong?",
  "@heydave7 Good idea",
  "@wintonARK During the darkest days of the Model 3 program, I reached out to Tim Cook to discuss the possibility of… https://t.co/opTz9UrNE0",
  "@wintonARK Strange, if true. \n\n- Tesla already uses iron-phosphate for medium range cars made in our Shanghai facto… https://t.co/MIlWSilvRT",
  "@archillect Sparta’s reply to Macedon",
  "@LizClaman @Tesla @FoxBusiness @ClamanCountdown Hi Liz!"
]