[
  "@Model3Owners I love Dieter",
  "@nbcsnl Chad saves Mars!",
  "SpaceX launching satellite Doge-1 to the moon next year\n\n– Mission paid for in Doge\n– 1st crypto in space\n– 1st meme in space\n\nTo the mooooonnn!!\n\nhttps://t.co/xXfjGZVeUW",
  "Wario was my fav haha 👀 \nhttps://t.co/TNjn3meLVJ",
  "@flcnhvy Might still need a VPN in some countries",
  "Special link to view SNL outside USA\nhttps://t.co/egSDZ8sNFu",
  "First time a Falcon rocket booster will reach double digits in flights https://t.co/wrojsaGExZ",
  "@WholeMarsBlog Yup 🤣🤣",
  "@PPathole @ericrihlmann @Tesla @nbcsnl @TimesSquareNYC @nycgov It pretty much looks like this",
  "@ericrihlmann @Tesla @nbcsnl @TimesSquareNYC @nycgov Great pic",
  "Cybertruck prototype in New York this weekend",
  "@EvaFoxU 🤣🤣",
  "@OwenSparks_ Until Sunday",
  "Guest starring … https://t.co/buM3bTOWbX",
  "https://t.co/DlQtmfjKqL",
  "@considercosmos @SpaceX Will use this as my wallpaper",
  "RT @nbcsnl: ELON MUSK. MILEY CYRUS.\nTHIS SATURDAY https://t.co/6miGBj90XJ",
  "@itsALLrisky That is how I feel about it",
  "@Teslarati @13ericralph31 Might try to refly SN15 soon",
  "@hiromichimizuno I’m looking for a shiba pup!",
  "@Erdayastronaut @SpaceX 😮",
  "Cryptocurrency is promising, but please invest with caution! https://t.co/A4kplcP8Vq",
  "@SpacePadreIsle Nice shot",
  "@DavidSpade 🤣🤣",
  "Make humanity a multiplanet species!",
  "Public support for life on Mars is critical to making it happen",
  "@flcnhvy @westcoastbill 2024 is not out of the question for an uncrewed flight",
  "@westcoastbill for sure!",
  "@ZachWeiner Haha true",
  "@johnkrausphotos @SpaceX Mars Base Alpha",
  "@GabrielGruber Exactly",
  "@MileyCyrus Haha awesome! See you soon.",
  "@jimfarley98 @thesheetztweetz Thanks Jim",
  "@nova_road True",
  "@nextspaceflight @NASASpaceflight Only way to create rapidly &amp; fully reusable orbital rockets, the fundamental technology revolution needed to make life multiplanetary",
  "RT @nbcsnl: https://t.co/qmIQF3fq5q",
  "Starship landing nominal!",
  "About to launch https://t.co/t4nki8vU4E",
  "@AaronGamelli I had a Steampunk Japan birthday party once",
  "@DavidSacks The Movement!\nhttps://t.co/dK15SJjQYK",
  "@newscientist Which means ~1/10th of you is 13.8 billion years old",
  "@karpathy 🤣🤣",
  "@thesheetztweetz Only limitation is high density of users in urban areas. Most likely, all of the initial 500k will receive service. More of a challenge when we get into the several million user range.",
  "RT @SpaceX: Falcon 9’s first stage has landed on the Of Course I Still Love You droneship – the 9th landing of this booster https://t.co/wz…",
  "RT @SpaceX: Watch Falcon 9 launch 60 Starlink satellites → https://t.co/bJFjLCzWdK  https://t.co/zXwBMcXUDJ",
  "RT @SpaceX: #MayThe4thBeWithYou https://t.co/1T7aXNZgkD",
  "@MeetLuis @WARREZ420 @WholeMarsBlog Rawlinson was never chief engineer. He arrived after Model S prototype was made, left before things got tough &amp; was only ever responsible for body engineering, not powertrain, battery, software, production or design.",
  "@spacex360 So great to see the happy faces!",
  "@utsavtechie Prototypes are easy, production is hard",
  "@heydave7 @Tesla A remarkable junction in history",
  "@jaentwistle One of many reasons why we need larger &amp; more advanced rockets!",
  "@jpr007 @EPCalderhead Haha",
  "RT @SpaceX: Splashdown of Dragon confirmed – welcome back to Earth, @AstroVicGlover, @Astro_illini, Shannon Walker, and @Astro_Soichi! http…",
  "I love Art Deco",
  "RT @SpaceX: Departure burns complete. Dragon will reenter the Earth's atmosphere in ~4 hours",
  "@RSTYCG 👍",
  "RT @NASA: LIVE: NASA's @SpaceX Crew-1 astronauts are strapped in for their journey home tonight. Watch the hatches close between Crew Drago…",
  "RT @SpaceX: Separation confirmed. Dragon will perform four departure burns to move away from the @space_station https://t.co/43GwSBrWJc",
  "Baby Shark &amp; Shark Tank merge to form Baby Shark Tank",
  "Irony Man – defeats villains using the power of irony",
  "@gshenanigans1 Definitely",
  "Throwing out some skit ideas for SNL. What should I do?",
  "Woke James Bond\nSNL May 8",
  "A major part of real-world AI has to be solved to make unsupervised, generalized full self-driving work, as the entire road system is designed for biological neural nets with optical imagers",
  "@WholeMarsBlog Exactly!",
  "@teslaownersSV Was using this in my car last night",
  "@teslaownersSV FSD display V9.0 will show actual probability distribution of objects – true mind’s eye of the neural net. This is so cool!",
  "@WhatsupFranks @danheld I swear Canada FSD beta will be as soon as humanly possible!",
  "@adamcarter @teslaownersSV @TeslaNY @Tesla True. Anyone paying attention to the rate of improvement will realize that Tesla Autopilot/FSD is already superhuman for highway driving &amp; swiftly getting there for city streets.",
  "@danheld 🤣🤣",
  "RT @SpaceX: Falcon 9’s first stage has landed on the Just Read the Instructions droneship, completing this booster’s seventh launch and lan…",
  "@jgrano305 @tobyliiiiiiiiii @teslaownersSV @TeslaNY @Tesla Hopefully, later this year for several more states. Insurance is different for almost every state in America &amp; regulatory approvals take time.",
  "@tobyliiiiiiiiii @teslaownersSV @TeslaNY @Tesla And hopefully EU this summer",
  "@tobyliiiiiiiiii @teslaownersSV @TeslaNY @Tesla Probably a few months. There are many subtle differences between US &amp; Canada driving.",
  "@teslaownersSV @TeslaNY @Tesla Gating factor is achieving &amp; proving higher safety with pure vision than with vision+radar. We are almost there.\n\nFSD Beta V9.0 will blow your mind.",
  "@teslaownersSV @TeslaNY @Tesla Probably two weeks",
  "@TeslaNY @Tesla Good technical analysis",
  "@heydave7 Yes",
  "@squawksquare Sorry 🤣🤣 \nhttps://t.co/v98BnxPXg6",
  "@WR4NYGov @garyblack00 @Tesla @WholeMarsBlog 🤣🤣 exactly",
  "@OwenSparks_ @nbcsnl @MileyCyrus Might be something there haha",
  "@skorusARK Best-selling by revenue in 2022, possibly by unit volume in 2023",
  "@collision @SpaceX Cool! 🇮🇪",
  "@RationalEtienne @Erdayastronaut @Twisi80 Starship is literally more pointy because of that movie haha",
  "@RiusJulien https://t.co/paTKsQjNp8",
  "♥️\nhttps://t.co/juLuKlymEX",
  "@AstroJordy @wapodavenport 0% so far",
  "@muratpak 🔥",
  "The Dogefather\nSNL May 8",
  "@wapodavenport Did my heart love till now? forswear it, sight!\nFor I ne'er saw true beauty till this night.",
  "@wapodavenport Romeo + Juliet, fish tank scene",
  "@Erdayastronaut @Twisi80 Testing header tanks. All good so far.",
  "@leastImAlive @thesheetztweetz They have an important role to play in protecting the public from getting swindled, but are sometimes too close to Wall St hedge funds imo. \n\nStrange that they aren’t taking more action on some of the SPACs.",
  "@thesheetztweetz FCC is fair &amp; sensible. NHTSA &amp; FAA too. 99.9% of the time, I agree with regulators! \n\nOn rare occasions, we disagree. This is almost always due to new technologies that past regulations didn’t anticipate.",
  "@garyblack00 Other companies spend money on advertising &amp; manipulating public opinion, Tesla focuses on the product. \n\nI trust the people.",
  "@DocumentingBTC Yes",
  "@PPathole Yup",
  "@garyblack00 @CGrantWSJ @WSJ I find it more helpful to read/follow individual journalists, rather than publications. \n\nAny given publication is going to have wide range of views, albeit vast majority of stories about any subject are negative, perhaps reflecting innate human biases.\n\nCitizen journalism FTW!",
  "@kchangnyt https://t.co/eLvYOnn6zT",
  "Starship SN15 static fire completed, preparing for flight later this week",
  "@jeff_foust True 🤣🤣",
  "@kchangnyt Can’t get it up (to orbit) lol",
  "@heydave7 Seems quite likely at least based on revenue in 2022 &amp; possibly total units in 2023",
  "@stoolpresidente No, you do not. I have not sold any of my Bitcoin. Tesla sold 10% of its holdings essentially to prove liquidity of Bitcoin as an alternative to holding cash on balance sheet.",
  "@jgrano305 @Orangetilt Yes",
  "@Orangetilt Yeah, roughly 200MW/km^2 using currently available solar panels. \n\nWhat’s really amazing is that you can store all energy needed to power a continent overnight with 1 square kilometer of stacked Tesla Megapacks!",
  "@PPathole An advantage I did have is that my father is a talented electrical &amp; mechanical engineer, so I was taught a lot engineering (without appreciating it at the time)",
  "@PPathole True. The opposite in fact – I provide financial support to my parents.",
  "RT @Space_Station: The @SpaceX Crew-1 astronauts will soon soar back to Earth and parachute to a splashdown off the coast of Florida. They…",
  "@BLKMDL3 @JohnnaCrider1 We just got approval to open a new Supercharger station in Malibu!",
  "@JohnnaCrider1 https://t.co/xl441YNnOs",
  "@BadAstronomer So awesome!",
  "Let’s find out just how live Saturday Night Live really is 😈",
  "Am hosting SNL on May 8",
  "@Tesmanian_com Yup",
  "RT @SpaceX: Docking confirmed – second time at the @space_station for this Dragon https://t.co/JLC9wOjRFT",
  "@KuroiKumanoashi Lies can be beautiful",
  "https://t.co/l6Bc0wkWol",
  "define … beauty",
  "What does the future hodl?",
  "RT @RealLifeStarman: “We need to have a big permanently occupied base on the moon, and then build a city on Mars and become a spacefaring c…",
  "@OwenSparks_ @PPathole Absolutely!",
  "@PPathole This is the essence of my philosophy",
  "@SciGuySpace This is important",
  "@lexfridman Yup",
  "RT @SpaceX: Dragon has separated from Falcon 9’s second stage and is on its way to the @space_station! Autonomous docking tomorrow at ~5:10…",
  "2 mins to launch https://t.co/q9nXKRrXpw",
  "Astronauts preparing to launch to @Space_Station https://t.co/WBkaDZexEc",
  "@JiriThunderDome Yeah",
  "@ICannot_Enough Haha true",
  "RT @xprize: Elon Musk and Peter Diamandis LIVE on $100M XPRIZE Carbon Removal https://t.co/M2ruxS0Zxt",
  "🌍🌎🌏 Happy Earth Day 🌍🌎🌏",
  "@hnshah Haha",
  "@jhall 🤣🤣",
  "RT @SpaceX: All systems and weather are looking good for Falcon 9’s launch of Dragon with four astronauts on board. Webcast will go live to…",
  "@AstroJordy I’m staying at a friend’s place in Florida that is 85% powered by Tesla Solar Roof + Powerwall. \n\nWhen grid power goes down, air-conditioning automatically turns off in some of the house. Computers &amp; lights don’t even flicker. Owner says he doesn’t notice.",
  "@28delayslater Does seem a little weird",
  "@OwenSparks_ @AstroJordy @neuralink 🤣",
  "@JohnnaCrider1 @WholeMarsBlog If Tesla owners are “conspiracy theorists”, then it would be fair to call them “advertising salespeople masquerading as truthtellers”. \n\nIf that’s an unfair criticism, a simple rebuttal would be to show their articles per fatality for all automakers. Tesla is  ~0.02% of deaths …",
  "Tesla Solar + Powerwall battery enables consumers to be their own utility",
  "@jack True",
  "@ValaAfshar Very important. Most people don’t know this. Wind is also super cheap, especially when paired with batteries.",
  "@annerajb Newest units can probably do as much as 10kW continuous &amp; double that in peak power at 30C ambient temp.\n\nIn house power vernacular, this translates to ~80LRA (soft start of 3.5 ton HVAC). Two Powerwalls would double this, three would triple, etc.",
  "Powerwall 2 peak &amp; steady power capability is better than advertised. \n\nNow that we have lots of operational data, Tesla can unlock higher capabilities for free via software update next month. \n\nDepending on production date, power increase power may be &gt;50% at 30C ambient temp.",
  "Solar power will feed exclusively to Powerwall. Powerwall will interface only between utility meter &amp; house main breaker panel, enabling super simple install &amp; seamless whole house backup during utility dropouts.",
  "Starting next week, Tesla Solar Panels &amp; Solar Roof will only be sold as an integrated product *with* Tesla Powerwall battery",
  "@wintonARK Did you buy a Powerwall? Utility permission is required for flowing electricity back to grid, but usually not if stored in our battery. This also enables 24/7 electricity security for your home.\n\nUtility permission is still needed for when Powerwall is full &amp; can stabilize grid.",
  "@TeslaNY Sandy Munro knows what he’s talking about",
  "RT @Commercial_Crew: Launch Update 🚀 @NASA and @SpaceX now are targeting Friday, April 23 at 5:49 a.m. ET for the launch of the Crew-2 miss…",
  "@teslaownersSV cgi irl!",
  "@PPathole @Tesla @SpaceX I could get a job, just not at an Internet company (weren’t many back then)",
  "@Liv_Boeree @TheBabylonBee Haha true",
  "@JohnnaCrider1 !!",
  "@kimpaquette New FSD rendering approach coming that better represents NN probability vector space",
  "@kimpaquette NHTSA is great",
  "@RenataKonkoly @GerberKawasaki Hell of a coincidence haha",
  "@GerberKawasaki 🤣",
  "RT @SpaceX: Falcon 9 and Dragon are looking good for flight of Crew-2 astronauts; teams are keeping an eye on launch site and downrange wea…",
  "@WholeMarsBlog Exactly",
  "@NASA Awesome!",
  "@Amart15416132 @WSJ Your research as a private individual is better than professionals @WSJ! \n\nData logs recovered so far show Autopilot was not enabled &amp; this car did not purchase FSD.\n\nMoreover, standard Autopilot would require lane lines to turn on, which this street did not have.",
  "@teslaownersSV @SpaceX @NASA @considercosmos Support for humanity’s future in space is super appreciated. Let’s make the sci-fi future we want real!",
  "@flcnhvy 🤣🤣",
  "RT @SpaceX: SpaceX and @NASA completed a full rehearsal of launch day activities with the four Crew-2 astronauts https://t.co/u0hDCTx3Zp",
  "@WholeMarsBlog Passive Autopilot (sometimes called active safety) comes standard on all Teslas",
  "@WholeMarsBlog Essentially, passive Autopilot (car intervenes only when crash probability is high) cuts crashes in half. \n\nActive Autopilot (car is driving itself) cuts crashes in half again. \n\nDoesn’t mean there are no crashes, but, on balance, Autopilot is unequivocally safer.",
  "Tesla with Autopilot engaged now approaching 10 times lower chance of accident than average vehicle https://t.co/6lGy52wVhC",
  "Dragon spacecraft &amp; Falcon 9 rocket https://t.co/A6fsNlsN9z",
  "@WhatsupFranks Great progress by Tesla team",
  "If we make life multiplanetary, there may come a day when some plants &amp; animals die out on Earth, but are still alive on Mars",
  "@neuralink @shivon Great review! Neuralink is open to working with neuroscientists to advance the field. \n\nShort-term goal is addressing brain &amp; spine problems. \n\nUltimate goal is symbiosis of human &amp; machine intelligence.",
  "Everything to the moon!",
  "We are honored to be part of the @NASAArtemis team",
  "🚀🖤💫 NASA Rules!! 💫🖤🚀 https://t.co/hmeGx2peZ6",
  "👀",
  "RT @Tesla: Cybertruck at Giga Texas https://t.co/c1RuektPnN",
  "🎸🎸 Austin Rocks!! 🎸 🎸",
  "@Model3Owners Same with Berlin",
  "@Model3Owners Limited production of Model Y this year, high volume next year",
  "@Model3Owners I was just there, driving Cybertruck around the site where it will be built!",
  "Make life multiplanetary! #Mars",
  "@Erdayastronaut @thesheetztweetz Yeah, should be fully mobile later this year, so you can move it anywhere or use it on an RV or truck in motion. We need a few more satellite launches to achieve compete coverage &amp; some key software upgrades.",
  "@thesheetztweetz This is accurate. Service uptime, bandwidth &amp; latency are improving rapidly. Probably out of beta this summer.",
  "@sadiaslayy @DogecoinBets 😮",
  "@lexfridman One of many reasons that we need to make life multiplanetary!",
  "@austinbarnard45 Aiming to launch next week",
  "@billhuang688 @RationalEtienne @F9Block5 Certainly one of the largest. A company whose name rhymes with Shmoogle is pretty far ahead. \n\nBut I think we’re the leader in shallow-minded AI haha!",
  "Doge Barking at the Moon https://t.co/QFB81D7zOL",
  "@WSBChairman Doge Barking at the Moon – Miro https://t.co/1vTM2XOusy",
  "@RationalEtienne @F9Block5 While perhaps obvious in hindsight, it turns out that the only way to solve self-driving is to solve a big part of real-world AI. That is what Tesla is doing, both in hardware &amp; software.\n\nUnless a company is good at AI with tight compute, it’s hopeless. This is insanely hard.",
  "Le Petit Prince",
  "☾\n\n           🔭𖨆♡",
  "@SpaceXMR Soon it will be real",
  "@janixos @ErcXspace @SpaceX Actually, yes. And Red Rocket truck stop.",
  "@andyweedman @karpathy @DirtyTesla Stop … In the Name of Love! https://t.co/kBsTi5jz16",
  "@AustinTeslaClub @TslaCC @teslaquadcities @teslaownersvn @SjvTesla @TeslaOwnersEBay @CodingMark @billhuang688 @gailalfa1 @Tesla 🥰",
  "@Teslarati I found some footage of the drive https://t.co/TXeLQO9Spr",
  "@AstroJordy @dogeofficialceo @F9Block5 Insanely cute!",
  "@WholeMarsBlog Button timing of May is aspirational. Depends on how well limited beta of V9.0 goes, but I would be surprised if wide beta (aka button) is later than June. FSD subscription next month is a sure thing.",
  "@cliffski @F9Block5 Hopefully addressed this summer",
  "@dogeofficialceo @F9Block5 🤣🤣",
  "@BLKMDL3 @F9Block5 Same timing",
  "@F9Block5 Major improvements are being made to the vision stack every week. Beta button hopefully next month.\n\nThis is a “march of 9’s” trying to get probability of no injury above 99.999999% of miles for city driving. Production Autopilot is already above that for highway driving.",
  "@jrosinski97 Will investigate",
  "@melaniemadri Probably late July",
  "Tesla AI/Autopilot engineering is awesome! Making excellent progress solving real-world AI.",
  "@ErcXspace @SpaceX 69th Raptor engine coming soon",
  "@ashleevance Maybe it’s about how you use it",
  "@PPathole @SwiftOnSecurity Getting there",
  "@AstroJordy @PPathole @SpaceX @Tesla That version of Falcon 1 never flew, so must be ~2004. The CAD looks so simple! I think we were still using SolidWorks back then.",
  "@eugenelee3 @PPathole @SpaceX @Tesla Yeah, not scalable. My grad student idea was to try to use advanced chip making equipment to create high energy density capacitors accurate to molecular level.",
  "@PPathole @SpaceX @Tesla That was my night job. Day job was working on ruthenium-tantalum ultracapacitors at Pinnacle Research.",
  "@PPathole @SpaceX @Tesla True. Ancient times … Had to flip CPU registers explicitly, as computer was so slow.",
  "@Erdayastronaut @Tesla Absolutely",
  "@Erdayastronaut @Tesla Tesla is building up collision repair capability to help address the grief that you went through, but usually insurance companies make you go their “approved” collision repair partners. Tesla Insurance will make it smooth sailing.",
  "@vincent13031925 For now. Costs are decreasing rapidly.",
  "Love this beautiful shot",
  "@agnostoxxx @CathieDWood @ARKInvest Trust the shrub",
  "The art In Cyberpunk is incredible",
  "@itsALLrisky 🤣🤣",
  "@seinfeldguru @WholeMarsBlog Nope haha",
  "@WholeMarsBlog If you don’t say anything &amp; engage Autopilot, it will soon guess based on time of day, taking you home or to work or to what’s on your calendar",
  "@DeltavPhotos @PortCanaveral That rocket is a hardcore veteran of many missions",
  "Blimps rock https://t.co/e8cu5FkNOI",
  "@engineers_feed Due to lower gravity, you can travel from surface of Mars to surface of Earth fairly easily with a single stage rocket. Earth to Mars is vastly harder.",
  "@DrPhiltill Good thread",
  "@alexellisuk Pretty much",
  "@tesla_adri @WholeMarsBlog These things are best thought of as probabilities. There are 5 forward-facing cameras. It is highly likely that at least one of them will see multiple cars ahead.",
  "@WholeMarsBlog Sensors are a bitstream and cameras have several orders of magnitude more bits/sec than radar (or lidar). \n\nRadar must meaningfully increase signal/noise of bitstream to be worth complexity of integrating it. \n\nAs vision processing gets better, it just leaves radar far behind.",
  "@WholeMarsBlog When radar and vision disagree, which one do you believe? Vision has much more precision, so better to double down on vision than do sensor fusion.",
  "@WholeMarsBlog This is a major problem!",
  "Just needs some legs",
  "The Starship launch tower that catches the giant rocket booster is basically Mechazilla",
  "But wait how is the core of the earth lit by the sun? Stop asking questions!!",
  "Kong vs Godzilla has record for most meth ever consumed in a writer’s room",
  "@itsALLrisky 💯",
  "… going to moon very soon",
  "@Matsu_Kusarine @jagarikin Actually happened to me in Cyberpunk haha",
  "@TimBirks1 @Erdayastronaut @SpaceX Pretty much",
  "@memescryptor !",
  "Where is Shrek 5!? https://t.co/PqAZ5Mg8Es",
  "@AustinTeslaClub @OwenSparks_ @WholeMarsBlog Good point. \n\nNext major software rev will do much better with automating wipers, seat heating &amp; defrost. \n\nProbable seat settings just based on occupant mass distribution should be possible.",
  "@Adamklotz_ @OwenSparks_ @WholeMarsBlog Yup",
  "@teslaownersSV @neuralink Turns out 🐒 love video games &amp; snacks just like us!",
  "It’s all about the cufflinks https://t.co/elccqC0Zuf",
  "@chicago_glenn I feel like this sometimes",
  "@OwenSparks_ @WholeMarsBlog It will",
  "@OwenSparks_ @WholeMarsBlog Remove",
  "@w00ki33 @SpaceX @SuperclusterHQ Simulation is improving rendering resolution  …",
  "@cleantechnica Congrats to NIO. That is a tough milestone.",
  "@WholeMarsBlog Almost ready with FSD Beta V9.0. Step change improvement is massive, especially for weird corner cases &amp; bad weather. Pure vision, no radar.",
  "Thanks to all that helped SpaceX!",
  "Just read it. Book is accurate. https://t.co/3bI9Vw8iP1",
  "@TeslaGong Yeah",
  "@mikevanbus @TrungTPhan @neuralink Pretty much",
  "https://t.co/XeQursZpvq",
  "Soon our monkey will be on twitch &amp; discord haha",
  "@thenewsoncnbc @contessabrewer Good piece!",
  "@Kyler_Knoll @neuralink Comes with wireless charging baseball cap",
  "@TarekWaked @TechCrunch @etherington Pretty much 🤣🤣 Great episode!",
  "A monkey is literally playing a video game telepathically using a brain chip!!",
  "@lexfridman @neuralink Yes",
  "The device is implanted flush with skull &amp; charges wirelessly, so you look &amp; feel totally normal",
  "@IheartTesla Absolutely doable. Possibly as soon as Neuralink device version 2, highly likely by version 3.",
  "Later versions will be able to shunt signals from Neuralinks in brain to Neuralinks in body motor/sensory neuron clusters, thus enabling, for example, paraplegics to walk again",
  "@mindofkacper @neuralink Yes",
  "First @Neuralink product will enable someone with paralysis to use a smartphone with their mind faster than someone using thumbs",
  "@IheartTesla @neuralink Hopefully, later this year",
  "@tobyliiiiiiiiii Sure",
  "Monkey plays Pong with his mind https://t.co/35NIFm4C7T",
  "@dogeofficialceo @WatchersTank @SpaceX Looking at pups soon!",
  "@jordanxmajel @WatchersTank @SpaceX Shock absorption is built into tower arms. Since tower is ground side, it can use a lot more mass to arrest booster downward momentum.",
  "@jordanxmajel @WatchersTank @SpaceX Load points just below the grid fins",
  "@WatchersTank @SpaceX Just one skyscraper catching another nbd haha",
  "Thanks Tesla suppliers for providing us with critical parts!",
  "@MarkJam93765764 @IvanEscobosa A tidal wave of vaccine is being produced!",
  "@jgrano305 Probably J&amp;J, but BioNtech &amp; Moderna are good too. Some debate imo as to whether a second synthetic mRNA shot is really needed, but the first is a no-brainer.",
  "@IvanEscobosa Latter",
  "To be clear, I do support vaccines in general &amp; covid vaccines specifically. The science is unequivocal. \n\nIn very rare cases, there is an allergic reaction, but this is easily addressed with an EpiPen.",
  "@DavidWillisSLS @_Jevis_ @PPathole Needs legs for moon &amp; Mars",
  "@SciGuySpace Global payload to orbit is the key metric",
  "@Julius_Burton @Erdayastronaut @DJSnM @NASASpaceflight @ChrisG_NSF @thejackbeyer @FelixSchlang Nice",
  "@_Jevis_ @PPathole Ideal scenario imo is catching Starship in horizontal “glide” with no landing burn, although that is quite a challenge for the tower! Next best is catching with tower, with emergency pad landing mode on skirt (no legs).",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed, completing SpaceX’s 10th mission this year https://t.co/c15BveB3QE",
  "@PPathole Starship booster, largest flying object ever designed, will be caught out of sky by launch tower. Big step forward, as reflight can be done in under an hour.",
  "@WholeMarsBlog Well-written and fair, much like his articles on space",
  "@louisssdev @flcnhvy Coming soon. Crazy number of launches this year!",
  "@flcnhvy They will be recovered from the water &amp; reused",
  "“Tanks for the memery!” – Panzer of the Lake",
  "@CathieDWood @wintonARK @ARKInvest What do you think of the unusually high ratio of S&amp;P market cap to GDP?",
  "@ID_AA_Carmack Some kind of ELO level, updated once or twice a year based on what someone actually got done, might be most effective. Important that it go both up *and* down.",
  "@Thomas38697956 New &amp; improved version!",
  "@Teslarati @ResidentSponge Special mention of Tesla China",
  "@shbzz Obv",
  "@Teslarati @ResidentSponge Great work by Tesla team!",
  "@EvaFoxU Nice",
  "The Earth is not flat, it’s a hollow globe &amp; Donkey King lives there!",
  "@EvaFoxU Those two really could have come in handy for the stuck ship!",
  "@EvaFoxU Last Kingdom vs Vikings",
  "@spacex360 Ascent phase, transition to horizontal &amp; control during free fall were good. \n\nA (relatively) small CH4 leak led to fire on engine 2 &amp; fried part of avionics, causing hard start attempting landing burn in CH4 turbopump. \n\nThis is getting fixed 6 ways to Sunday.",
  "RT @SpaceX: Dragon is go for the first-ever port relocation flight of a commercial spacecraft https://t.co/qV7AktWsqQ",
  "Godzilla vs Kong is so amaze much wow!\nMost insane movie I’ve ever seen!\nLove letter to conspiracy theorists!\nAnd yet heartwarming in the end.",
  "@TerminalCount The Starships feast in Valhalla!",
  "@TerminalCount One of the greatest things I’ve ever seen",
  "@floko12022021 @HamblinZeke @katlinegrey Ich habe ein Semester Deutsch an der Universität studiert usw",
  "@HamblinZeke @katlinegrey Haha Falcon? Nein!",
  "@tobyliiiiiiiiii @katlinegrey I recommend propulsive landing, as that is extensible to planets, moons &amp; asteroids. Wings &amp; runways are limited to Earth.",
  "@PPathole @katlinegrey For practical purposes, there is no limit. It will just get increasingly difficult to service.",
  "@katlinegrey This a good path, but I recommend aiming for full reusability",
  "Urgent need to build more housing in greater Austin area!",
  "Austin++",
  "No it doesn’t hurt at all 🩸 https://t.co/NnL6o1si0V",
  "@allrocketsboi True",
  "@GerberKawasaki I fried a lot of neurons on that problem!",
  "Me in my sick new car\n(left him the money) https://t.co/EGaY1FVfHm",
  "@TrungTPhan Had no money to invest in Zip2, but my founder equity yielded ~$15M after tax. Of that, I rolled ~$10M into PayPal, which yielded ~$180M, then … \n\nBasic principle is that I would not ask investors to risk money on my company if I would not also do so.",
  "@Gfilche Major new Supercharger station coming to Santa Monica soon! Hoping to have 50’s diner &amp; 100 best movie clips playing too. Thanks Santa Monica city!",
  "@teslaownersSV @Tesla 🤣🤣",
  "@thesheetztweetz After all, SpaceX’s first payload to orbit &amp; back was a wheel of cheese …",
  "@FrancisSuarez @boringcompany @alexDLPmiami Glad you enjoyed the experience!",
  "SpaceX is going to put a literal Dogecoin on the literal moon",
  "Nicheman — his superpower is appealing to small audiences",
  "@waitbutwhy !!",
  "@lexfridman True",
  "Over 10,000 people are needed for Giga Texas just through 2022!\n- 5 mins from airport\n-15 mins from downtown\n- Right on Colorado river https://t.co/w454iXedxB",
  "@jdeshetler @NASASpaceflight @SpaceX @BocaChicaGal Can be a little foggy sometimes :)",
  "@Erdayastronaut @LabPadre Barely a scratch. :)\nBack on the stand soon!\nWill report conclusions as soon as we know them.",
  "Starbase will grow by several thousand people over the next year or two",
  "@OwenSparks_ I sure hope so!",
  "@OwenSparks_ Agreed! We’re not super far, as Magic Valley Utility can give us almost all wind-power, which will be used for LOX (78% of propellant mass)/N2/argon distillation. We’re also aiming to increase solar power from 1MW to 10MW, paired with Tesla Megapacks, for continuous power.",
  "Probably most “in space” you could possibly feel by being in a glass dome https://t.co/SOAIzxVGgX",
  "Am donating $20M to Cameron County schools &amp; $10M to City of Brownsville for downtown revitalization. Details to follow next week.",
  "@Adamklotz_ @SpaceX BN1 is a manufacturing pathfinder, so will be scrapped. We learned a lot, but have already changed design to BN2. \n\nGoal is to get BN2 with engines on orbital pad before end of April. It might even be orbit-capable if we are lucky.",
  "Please consider moving to Starbase or greater Brownsville/South Padre area in Texas &amp; encourage friends to do so! \n\nSpaceX’s hiring needs for engineers, technicians, builders &amp; essential support personnel of all kinds are growing rapidly.",
  "@CodingMark @Adamklotz_ @SpaceX More like V10.0",
  "@Adamklotz_ @SpaceX Next major technology rev is at SN20. Those ships will be orbit-capable with heat shield &amp; stage separation system. Ascent success probability is high.\n\nHowever, SN20+ vehicles will probably need many flight attempts to survive Mach 25 entry heating &amp; land intact.",
  "@Adamklotz_ @SpaceX SN15 rolls to launch pad in a few days. It has hundreds of design improvements across structures, avionics/software &amp; engine. \n\nHopefully, one of those improvements covers this problem. If not, then retrofit will add a few more days.",
  "@SpaceX Looks like engine 2 had issues on ascent &amp; didn’t reach operating chamber pressure during landing burn, but, in theory, it wasn’t needed. \n\nSomething significant happened shortly after landing burn start. Should know what it was once we can examine the bits later today.",
  "@SpaceX At least the crater is in the right place!",
  "@SpaceX A high production rate solves many ills",
  "@Tesmanian_com Demand is no problem, but near-term cell supply makes it hard to scale Semi. This limitation will be less onerous next year.",
  "@Erdayastronaut Tracking to a potential 8am liftoff",
  "@wapodavenport That would be great, or possibly via video with full access to telemetry",
  "FAA inspector unable to reach Starbase in time for launch today. Postponed to no earlier than tomorrow.",
  "Possible Starship flight tomorrow afternoon",
  "@PPathole @nbcsnl Trying",
  "@ChitaGranger @frost_367 Who is 👌",
  "@nbcsnl Nice",
  "Wholesome memes https://t.co/u5TkHJua8Q",
  "@summerlinARK We should be laughing our asses off if it’s so damn smart!",
  "@summerlinARK I wanna know when AI will be able to do standup comedy well!?",
  "@summerlinARK Sounds about right",
  "@summerlinARK It’s not really possible to match the human brain in 2021 for any amount of money imo, but it will be possible probably in a few years",
  "@cleantechnica This is crazy. Should use Tesla Megapacks for load-leveling the grid. More effective, more reliable and costs less.",
  "@AstroJordy Haha actually true",
  "Check out our new crane https://t.co/PE4vL6uKcb",
  "@RationalEtienne @TwitterSupport @jack This appears to be widespread. I wonder who is doing it …",
  "@ICannot_Enough @waitbutwhy We are too cell-constrained right now, but probably ok next year",
  "@waitbutwhy Great video",
  "@Erdayastronaut @SpaceX @Blackmagic_News @andrutay @bstineman @SpacePadreIsle @considercosmos Standing down SN11 until probably Monday. Additional checkouts are needed. Doing our best to land &amp; fully recover.",
  "@AdamSinger Haha",
  "@SpaceXMR Heavy comes in more like a javelin. Similar to Falcon 9, but caught by the tower vs landing on legs.",
  "@WholeMarsBlog I think there is a &gt;0% chance Tesla could be the biggest company",
  "@cleantechnica Solar has come a long way. Now just needs lots of long-life batteries!",
  "RT @Tesla: 6,000+ Superchargers across Europe — at 600 locations and counting!\n\n📸 by @EPavlic, @MinimalDuck &amp; @_better_e https://t.co/Yf36H…",
  "@SpaceXMR 🤣🤣",
  "@TheOnion Shame on you, Onion. This is why people are switching to @TheBabylonBee!",
  "@howlpolitically @TheOnion 2/2\nMy father &amp; his extended family have been dependent on financial support from my brother &amp; me for over 20 years. \n\nThis article is actually accurate: https://t.co/eVpCX9V1NB",
  "@howlpolitically @TheOnion 1/2\nThis article is false. \n- I arrived by myself in Canada in ‘89 with ~CA$2500\n- Paid my own way through college, ending with ~$100k student debt\n- Started 1st company with no funding &amp; just one computer I built\n- There’s no evidence whatsoever of an “emerald mine”",
  "@JubanMohamed There will be no handles",
  "If there’s ever a scandal about me, *please* call it Elongate",
  "@universal_sci This comment thread is 🔥",
  "Don’t defy DeFi",
  "@itsALLrisky @KimDotcom 👀",
  "Mars rover looking back https://t.co/oaFOCezRuU",
  "@KimDotcom Fair point",
  "@dogecoinww @MattWallace888 @CorinnaKopf You raise a good point haha",
  "@blockfolio 🤣🤣",
  "@EvaFoxU Wow, shame on ZDF Info!",
  "RT @SpaceX: Deployment of 60 Starlink satellites confirmed https://t.co/Xcbrq66Mez",
  "@lexfridman 👍",
  "Pay by Bitcoin capability available outside US later this year",
  "Tesla is using only internal &amp; open source software &amp; operates Bitcoin nodes directly.\n\nBitcoin paid to Tesla will be retained as Bitcoin, not converted to fiat currency.",
  "You can now buy a Tesla with Bitcoin",
  "@WholeMarsBlog @joeys_lady @DrSej Yup",
  "@bindureddy And books haha",
  "@bindureddy You can basically learn anything on YouTube/Reddit",
  "RT @Fogdo: Thank you @Tesla for this helpful and cool feature :-) https://t.co/FLuY3yFdSL",
  "@flcnhvy @arstechnica @SciGuySpace SpaceX will be landing Starships on Mars well before 2030. The really hard threshold is making Mars Base Alpha self-sustaining.",
  "@RenataKonkoly He was great on many levels https://t.co/exrZ1G9Rqk",
  "Strongest argument against aliens https://t.co/eF2FFZpJQE",
  "@lexfridman @AndrewYang !",
  "@WholeMarsBlog I once did a road trip across most of US with 2 adults &amp; 5 kids in a Model S!",
  "@arstechnica @SciGuySpace They are aiming too low. \n\nOnly rockets that are fully &amp; rapidly reusable will be competitive. \n\nEverything else will seem like a cloth biplane in the age of jets.",
  "@WholeMarsBlog The new Plaid S is our best car ever. Will be first production car to achieve 0-60mph in under 2 secs &amp; it has four doors &amp; seats up to 7 people.",
  "@TheMarsSociety SpaceX is developing rockets needed to make life multiplanetary — full &amp; rapid reusability at large scale. Even if SpaceX fails in that goal, the rockets will still be most advanced on Earth.\n\nStarlink‘s purpose is to provide Internet to the least served &amp; to pay for Mars.",
  "@bluemoondance74 @NASASpaceflight Going well. Lot of work for an extra 20 secs of Isp!",
  "@NASASpaceflight Hopefully will happen this decade",
  "@newscientist True",
  "@cleantechnica I am accumulating resources to help make life multiplanetary &amp; extend the light of consciousness to the stars"
]